{
  "search_term": "today's ate",
  "visited_articles": [
    {
      "url": "https://en.wikipedia.org/wiki/May_24",
      "content": "Article Talk English Read Edit View history Tools Tools move to sidebar hide Actions Read Edit View history General What links here Related changes Upload file Permanent link Page information Cite this page Get shortened URL Download QR code Expand all Edit interlanguage links Print/export Download as PDF Printable version In other projects Wikimedia Commons Wikinews Wikiquote Wikidata item\n\nChecked From Wikipedia, the free encyclopedia Page version status This is an accepted version of this page This is the latest accepted revision, reviewed on 24 May 2025. \"24/5\" redirects here. For the song by Mimi Webb, see 24/5 (song). << May >> Su Mo Tu We Th Fr Sa 0 1 0 2 0 3 0 4 0 5 0 6 0 7 0 8 0 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 2025 May 24 in recent years 2025 (Saturday) 2024 (Friday) 2023 (Wednesday) 2022 (Tuesday) 2021 (Monday) 2020 (Sunday) 2019 (Friday) 2018 (Thursday) 2017 (Wednesday) 2016 (Tuesday) Day of the year May 24 is the 144th day of the year (145th in leap years ) in the Gregorian calendar; 221 days remain until the end of the year. Events [ edit ] Pre-1600 [ edit ] 919 – The nobles of Franconia and Saxony elect Henry the Fowler at the Imperial Diet in Fritzlar as king of the East Frankish Kingdom. 1218 – The Fifth Crusade leaves Acre for Egypt. 1276 – Magnus Ladulås is crowned King of Sweden in Uppsala Cathedral. 1487 – The ten-year-old Lambert Simnel is crowned in Christ Church Cathedral, Dublin, Ireland, with the name of Edward VI in a bid to threaten King Henry VII 's reign. 1567 – Erik XIV of Sweden and his guards murder five incarcerated Swedish nobles. 1595 – Nomenclator of Leiden University Library appears, the first printed catalog of an institutional library. 1601–1900 [ edit ] 1607 – Jamestown, the first permanent English colony in North America, is founded. [ 1 ] 1621 – The Protestant Union is formally dissolved. 1626 – Peter Minuit buys Manhattan. 1667 – The French Royal Army crosses the border into the Spanish Netherlands, starting the War of Devolution opposing France to the Spanish Empire and the Triple Alliance. 1683 – The Ashmolean Museum in Oxford, England, opens as the world's first university museum. 1689 – The English Parliament passes the Act of Toleration protecting dissenting Protestants but excluding Roman Catholics. 1738 – John Wesley is converted, essentially launching the Methodist movement; the day is celebrated annually by Methodists as Aldersgate Day and a church service is generally held on the preceding Sunday. 1798 – The Irish Rebellion of 1798 led by the United Irishmen against British rule begins. 1813 – South American independence leader Simón Bolívar enters Mérida, leading the invasion of Venezuela, and is proclaimed El Libertador (\"The Liberator\"). 1822 – Battle of Pichincha: Antonio José de Sucre secures the independence of the Presidency of Quito. 1832 – The First Kingdom of Greece is declared in the London Conference. 1844 – Samuel Morse sends the message \"What hath God wrought\" (a biblical quotation, Numbers 23:23) from a committee room in the United States Capitol to his assistant, Alfred Vail, in Baltimore, Maryland, to inaugurate a commercial telegraph line between Baltimore and Washington D.C. [ 2 ] 1856 – John Brown and his men kill five slavery supporters at Pottawatomie Creek, Kansas. 1861 – American Civil War: Union troops occupy Alexandria, Virginia, with Colonel Elmer E. Ellsworth becoming the first Union officer to be killed during the war. [ 3 ] 1873 – Patrick Francis Healy becomes the first black president of a predominantly white university in the United States. [ 4 ] 1883 – The Brooklyn Bridge in New York City is opened to traffic after 14 years of construction. 1900 – Second Boer War: The United Kingdom annexes the Orange Free State.",
      "timestamp": "2025-05-24T14:34:35.604889"
    }
  ],
  "search_history": [
    {
      "query": "current date",
      "results": "1. **No title**\n   URL: https://www.timeanddate.com/\n   Description: \n\n2. **No title**\n   URL: https://www.rapidtables.com/tools/todays-date.html\n   Description: \n\n3. **No title**\n   URL: https://today-date.com/\n   Description: \n\n4. **No title**\n   URL: https://www.inchcalculator.com/what-is-todays-date/\n   Description: \n\n5. **No title**\n   URL: https://www.epochconverter.com/daynumbers\n   Description: "
    },
    {
      "query": "May 24 historical events holidays",
      "results": "1. **No title**\n   URL: https://www.onthisday.com/events/may/24\n   Description: \n\n2. **No title**\n   URL: https://en.wikipedia.org/wiki/May_24\n   Description: \n\n3. **No title**\n   URL: https://www.timeanddate.com/on-this-day/may/24\n   Description: \n\n4. **No title**\n   URL: https://www.history.com/this-day-in-history/may-24\n   Description: \n\n5. **No title**\n   URL: https://www.holidays-and-observances.com/may-24.html\n   Description: "
    }
  ],
  "timestamp": "2025-05-24T14:34:46.611509"
}