{
  "search_term": "look up at least 4 sources and tell me the lastest government news",
  "visited_articles": [
    {
      "url": "https://www.whitehouse.gov/videos/president-trump-signs-executive-orders-in-the-oval-office-may-23-2025/",
      "content": "Videos President Trump Signs Executive Orders in the Oval Office, May 23, 2025 May 23, 2025\n\nExplore More Videos 01:54 MAGA Minute, May 23, 2025 May 23, 2025 01:24 President Trump Signs Four Executive Orders on Nuclear Energy: A Huge Day For the Nuclear Industry May 23, 2025 38:40 President Trump Participates in a MAHA Commission Event May 22, 2025 18:07 President Trump Welcomes the 2025 Men’s NCAA Basketball Champions, The University of Florida Gators May 21, 2025 View all videos",
      "timestamp": "2025-05-24T14:54:08.845112"
    },
    {
      "url": "https://www.npr.org/2025/05/16/1251782081/1a-05-16-2025",
      "content": "The News Roundup For May 16, 2025: 1A The Supreme Court hears oral arguments in a case about President Donald Trump's executive order on birthright citizenship. House Republicans unveil a bill to cut congressional spending. The U.S. and China hammer out a trade deal that reduces tariffs for 90 days. President Donald Trump visits the Middle East, announcing a slew of economic deals and partnerships. But back home, a luxury jet from the Qatari government takes over the headlines. Want to support 1A? Give to your local public radio station and subscribe to this podcast. Have questions? Connect with us. Listen to 1A sponsor-free by signing up for 1A+ at plus.npr.org/the1a.\n\n1A NPR 1A LISTEN & FOLLOW NPR App Apple Podcasts Spotify Amazon Music iHeart Radio YouTube Music RSS link The News Roundup For May 16, 2025 May 16, 2025 5:02 PM ET The News Roundup For May 16, 2025 Listen · 1:22:24 1-Hour, 22-Minute Listen Playlist Toggle more options Download Embed Embed < iframe src=\"https://www.npr.org/player/embed/1251782081/1269325067\" width=\"100%\" height=\"290\" frameborder=\"0\" scrolling=\"no\" title=\"NPR embedded audio player\"> Enlarge this image U.S. President Donald J. Trump addresses the audience at the King Abdul Aziz International Conference Center while attending a Saudi-U.S. business investment forum. Win McNamee/Getty Images hide caption toggle caption Win McNamee/Getty Images U.S. President Donald J. Trump addresses the audience at the King Abdul Aziz International Conference Center while attending a Saudi-U.S. business investment forum. Win McNamee/Getty Images The Supreme Court hears oral arguments in a case about President Donald Trump's executive order on birthright citizenship. House Republicans unveil a bill to cut congressional spending. The U.S. and China hammer out a trade deal that reduces tariffs for 90 days. President Donald Trump visits the Middle East, announcing a slew of economic deals and partnerships. But back home, a luxury jet from the Qatari government takes over the headlines. Find more of our programs online. Listen to 1A sponsor-free by signing up for 1A+ at plus.npr.org/the1a. Sponsor Message Facebook Flipboard Email More Stories From NPR 1A The News Roundup For May 23, 2025 1A What Cuts To USDA Funding Mean For America's Food Banks And Farms 1A Rhiannon Giddens' Love Letter To The Music Of North Carolina 1A How Can States Improve Student Reading Scores? 1A 'If You Can Keep It': The Lawsuits Against The Trump Administration 1A The State Of The Supreme Court Popular on NPR.org Africa Trump's debunked 'burial site' video reopens 'wounds,' says victim's son Education By the numbers: A look at international students at Harvard and across the U.S. Politics Graphics: Here's what it will take to transform the Qatari jet into Air Force One Immigration Mahmoud Khalil told a judge his deportation could be a death sentence. Here's why National Justice Department cuts to public safety grants leave police and nonprofits scrambling National Why did university police chase a student and his baby across a graduation stage? NPR Editors' Picks National Americans are warned as latest DMV phishing scam targets phones National A hike on Cerro San Cristobal with stunning views of the Chilean Andes Simon Says Opinion: Cheers to a life well lived Pop Culture Happy Hour Final Destination still works — here's why Science That zing in your teeth from a cold treat? Blame this ancient armored fish Up First Newsletter This Memorial Day, NPR readers honor the ones they've lost Read & Listen Home News Culture Music Podcasts & Shows Connect Newsletters Facebook Instagram Press Public Editor Corrections Contact & Help About NPR Overview Diversity NPR Network Accessibility Ethics Finances Get Involved Support Public Radio Sponsor NPR NPR Careers NPR Shop NPR Events NPR Extra Terms of Use Privacy Your Privacy Choices Text Only © 2025 npr Sponsor Message Sponsor Message Become an NPR sponsor\n\nNPR 1A LISTEN & FOLLOW NPR App Apple Podcasts Spotify Amazon Music iHeart Radio YouTube Music RSS link\n\nThe News Roundup For May 16, 2025 Listen · 1:22:24 1-Hour,",
      "timestamp": "2025-05-24T14:54:16.049619"
    },
    {
      "url": "https://www.pbs.org/newshour/show/may-23-2025-pbs-news-hour-full-episode",
      "content": "May 23, 2025 PBS News Hour full episode May 23, 2025 7:40 PM EDT Leave your feedback Share Copy URL https://www.pbs.org/newshour/show/may-23-2025-pbs-news-hour-full-episode Email Facebook Twitter LinkedIn Pinterest Tumblr Share on Facebook Share on Twitter Friday on the News Hour... Friday on the News Hour, Harvard sues after the Trump administration tries to ban the university from enrolling international students. Cryptocurrency investors spend millions for a seat at the table with the president in a private dinner that's fueling concerns about Trump profiting from the presidency. Plus, the former U.S. ambassador to Ukraine explains why she resigned. Listen to the Broadcast Subscribe to the Full Show Podcast Play 00:00 … Volume Segments From This Episode What Trump’s legal and political clash with Harvard means for higher education 7 min News Wrap: Trump threatens new tariffs on EU imports and iPhones 6 min Private event with crypto customers fuels accusations of Trump profiting off presidency 7 min ‘We’re playing into Russia’s hands’: Ex-U.S. ambassador to Ukraine on why she resigned 7 min How NOAA funding cuts could make it harder to predict and prepare for severe weather 7 min Brooks and Capehart on House Republicans passing Trump’s legislative agenda 11 min Basketball legend Dawn Staley reflects on successes and challenges in ‘Uncommon Favor’ 8 min Support Provided By: Learn more Support PBS News: More Ways to Watch PBS Video PBS App YouTube Facebook Educate your inbox Subscribe to Here’s the Deal, our politics newsletter for analysis you won’t find anywhere else. Enter your email address Subscribe Thank you. Please check your inbox to confirm. Trending Now Watch May 23 Brooks and Capehart on House Republicans passing Trump’s legislative agenda Read May 24 WATCH: Trump delivers commencement speech to West Point graduating class of 2025 Read May 22 House Republicans narrowly passed Trump’s ‘big, beautiful’ bill. Here’s what’s in it Read May 24 Musician Billy Joel cancels tour after being diagnosed with brain disorder Read May 21 Fact-checking Trump’s claims of white farmer ‘genocide’ in South Africa\n\nLeave your feedback Share Copy URL https://www.pbs.org/newshour/show/may-23-2025-pbs-news-hour-full-episode Email Facebook Twitter LinkedIn Pinterest Tumblr Share on Facebook Share on Twitter Friday on the News Hour... Friday on the News Hour, Harvard sues after the Trump administration tries to ban the university from enrolling international students. Cryptocurrency investors spend millions for a seat at the table with the president in a private dinner that's fueling concerns about Trump profiting from the presidency. Plus, the former U.S. ambassador to Ukraine explains why she resigned. Listen to the Broadcast Subscribe to the Full Show Podcast Play 00:00 … Volume Segments From This Episode What Trump’s legal and political clash with Harvard means for higher education 7 min News Wrap: Trump threatens new tariffs on EU imports and iPhones 6 min Private event with crypto customers fuels accusations of Trump profiting off presidency 7 min ‘We’re playing into Russia’s hands’: Ex-U.S. ambassador to Ukraine on why she resigned 7 min How NOAA funding cuts could make it harder to predict and prepare for severe weather 7 min Brooks and Capehart on House Republicans passing Trump’s legislative agenda 11 min Basketball legend Dawn Staley reflects on successes and challenges in ‘Uncommon Favor’ 8 min\n\nHealth May 24 Why it’s important everyone wears sunscreen — even if you have a darker skin tone By Adithi Ramakrishnan, Associated Press\n\nPolitics May 24 WATCH: Trump delivers commencement speech to West Point graduating class of 2025 By Seung Min Kim, Ali Swenson, Associated Press\n\nArts May 24 Musician Billy Joel cancels tour after being diagnosed with brain disorder By Associated Press\n\nWorld May 24 Russian launches massive nighttime drone and missile attack on Kyiv By Illia Novikov, Alex Babenko, Associated Press\n\nWorld May 23 How one UN leader’s mistaken timeline caused confusion about Gaza children’s starvation risk By Grace Abels, PolitiFact\n\nNation May 23 Federal investigators work to determine cause of deadly San Diego plane crash By",
      "timestamp": "2025-05-24T14:54:24.503202"
    }
  ],
  "search_history": [
    {
      "query": "latest government news May 2025",
      "results": "1. **No title**\n   URL: https://www.whitehouse.gov/videos/the-make-america-healthy-again-report-may-22-2025/\n   Description: \n\n2. **No title**\n   URL: https://www.whitehouse.gov/videos/president-trump-signs-executive-orders-in-the-oval-office-may-23-2025/\n   Description: \n\n3. **No title**\n   URL: https://www.npr.org/2025/05/16/1251782081/1a-05-16-2025\n   Description: \n\n4. **No title**\n   URL: https://www.youtube.com/watch?v=6tHIgsLQ-b0\n   Description: \n\n5. **No title**\n   URL: https://www.pbs.org/newshour/show/may-23-2025-pbs-news-hour-full-episode\n   Description: "
    }
  ],
  "timestamp": "2025-05-24T14:54:30.772413"
}