{
  "search_term": "amelia aerhart disappearence",
  "visited_articles": [
    {
      "url": "https://en.wikipedia.org/wiki/Speculation_on_the_disappearance_of_Amelia_Earhart_and_Fred_Noonan",
      "content": "Article Talk English Read Edit View history Tools Tools move to sidebar hide Actions Read Edit View history General What links here Related changes Upload file Permanent link Page information Cite this page Get shortened URL Download QR code Add interlanguage links Expand all Print/export Download as PDF Printable version In other projects Wikidata item\n\nAppearance move to sidebar hide Text Small Standard Large This page always uses small font size Width Standard Wide The content is as wide as possible for your browser window. Color (beta) Automatic Light Dark This page is always in light mode.\n\nFrom Wikipedia, the free encyclopedia Theories on 1937 disappearance of American aviators This article contains one or more duplicated citations. show The reason given is: DuplicateReferences detected: http://news.discovery.com/history/us-history/aluminum-fragment-appears-to-belong-to-earharts-plane-141028.htm (refs: 33, 34) http://tighar.org/Projects/Earhart/Books/BookReviews/earhartsurvive.html (refs: 61, 62) It is recommended to use named references to consolidate citations that are used multiple times. ( April 2025 ) ( Learn how and when to remove this message ) Amelia Earhart and Fred Noonan Speculation on the disappearance of Amelia Earhart and Fred Noonan has continued since their disappearance in 1937. After the largest search and rescue attempt in history up to that time, the U.S. Navy concluded that Earhart and Noonan ditched at sea after their plane ran out of fuel; this \"crash and sink theory\" is the most widely accepted explanation. However, several alternative hypotheses have been considered. [ 1 ] Theories [ edit ] Gardner Island hypothesis [ edit ] Gardner ( Nikumaroro ) Island in 2014. \"Seven Site\" is a focus of the search for Earhart's remains. The Gardner Island hypothesis assumes that Earhart and Noonan, unable to find Howland Island, would not waste time searching for it, instead turning to the south to look for other islands. The 157/337 radio transmission suggests they flew a course of 157° that would take them past Baker Island; if they missed this, then sometime later they would fly over the Phoenix Islands, now part of the Republic of Kiribati, about 350 nautical miles (650 km) south-southeast of Howland Island. One of the Phoenix Islands, known as Gardner Island (now Nikumaroro), has been the subject of inquiry as a possible crash-landing site. The International Group for Historic Aircraft Recovery ( TIGHAR ) presented a hypothesis that Earhart and Noonan found Gardner Island, uninhabited at the time, landed the Electra on a flat reef near the November 1929 wreck of freighter SS Norwich City, and sent sporadic radio messages from there. [ 2 ] Ric Gillespie, author of Finding Amelia, wrote that while listening to alleged radio signals on their home radios, Mabel Larremore heard a woman claiming to be Earhart say Noonan was \"seriously injured\" and that she had \"some injuries but not as serious as Mr. Noonan's.\" Betty Klenck heard an apparently injured man acting agitated with a distressed woman claiming to be Earhart, and uttering repeatedly what sounded like, \"Marie\". Noonan's wife's first name was Mary Bea. The man said \"Water's knee deep – let me out.\" Klenck heard the woman say, \"George, get the suitcase in my closet...California.\" Four years earlier, in a letter to her mother, Earhart had asked that, should anything ever happen to her, the suitcase of private papers stored in her closet in California be destroyed; George Putnam was her husband. Klenck heard the woman repeatedly say something that sounded like \"New York City\", which has been speculated to have been actually Norwich City, the freighter wreck. A week after Earhart and Noonan disappeared, Navy planes from USS Colorado (which had sailed from Pearl Harbor ) searched Gardner Island. The planes saw signs of recent habitation and the wreck of the SS Norwich City, but no aircraft, and repeated circling failed to bring out any signs of survivors seeking rescue. [ 3 ] TIGHAR theorises that the Electra had by then been washed over the reef edge into the ocean where it broke up and sank.",
      "timestamp": "2025-05-24T14:49:47.845073"
    },
    {
      "url": "https://www.bbc.com/future/article/20240131-researchers-say-amelia-earharts-long-lost-plane-may-have-just-been-found",
      "content": "Researchers say they may have just found Amelia Earhart’s long-lost plane – experts aren’t convinced\n\nClaims that a recent undersea discovery may be Amelia Earhart’s long-lost aeroplane raise questions. Experts weigh in on the mystery that continues to captivate us.\n\nResearchers believe they may have found aviator Amelia Earhart's long-lost plane. Sonar imaging, which maps the ocean floor using sound waves, just led researchers to what they claim is a small aircraft. The discovery was made at around 4,877m (16,000ft) from the surface of the Pacific Ocean. The team has claimed via social media that they have reason to believe this could be the Lockheed 10-E Electra that went missing 87 years ago, when Earhart and her co-pilot Fred Noonan attempted to fly around the world. Footage of the undersea expedition was shared by Deep Sea Vision, an ocean exploration company, in a post on Instagram on 27 January. \"Deep Sea Vision scanned more than 5,200 square miles of ocean floor with a 16-person crew and the Kongsberg Discovery HUGIN 6000, the most advanced unmanned underwater drone, before finding what could be the legendary American aviator's Lockheed 10-E Electra,\" the organisation wrote in a video caption of the crew's exploration. The mystery of what happened to Amelia Earhart’s plane has baffled researchers for decades, while managing to still capture public interest. A 2017 History Channel documentary explored one captivating theory: that Earhart and Noonan survived the crash, landed in the Marshall Islands and were taken captive by the Japanese. The documentary also implies that the US government knew what happened to the aviators all along.\n\nOne opinion is that Earhart's plane crashed when it ran out of fuel near Howland Island. Dorothy Cochrane, the Aeronautics Department curator at the Smithsonian National Air and Space Museum in Washington DC, holds this view. She told the BBC that, \"Given the strength of her radio call to the USCG Itasca, waiting at Howland Island, Amelia Earhart and Fred Noonan were not far from the island.\" Earhart stated, \"We must be on you…\" before her demise, said Cochrane. \"It seems that tragically they could not find the tiny island before they had to ditch the Electra into the Pacific Ocean,\" she added.\n\nWhile Cochrane feels fairly certain about what happened to Earhart, she’s not sold that the latest discovery is her plane, given the only evidence so far is a sonar image. \"Photographing the object would greatly assist in identifying it further,\" Cochrane said. \"I am encouraged that DSV is searching near Howland Island and believe they would like to make another expedition to conduct more research.\" Richard Jantz, professor emeritus of anthropology and director emeritus at the University of Tennessee, Knoxville's Forensic Anthropology Center, believes he knows what happened to Earhart. In 2018, he re-examined seven bone measurements conducted in 1940 by physician DW Hoodless, who had believed the bones belonged to a man. Using Fordisc, a far more modern computer programme, Jantz found that crucial errors had been made. He also noted in the study, \"There was suspicion at the time that the bones could be the remains of Amelia Earhart.\" His findings revealed that the bones were more similar to Earhart’s than 99 percent of individuals in a large reference sample. If the bones did, in fact, belong to Earhart, that would mean she died on the island of Nikumaroro, where they were discovered, which is about 640km south of Howland. Jantz tells the BBC that his views haven't changed with the new discovery. \"In order for the Nikumaroro hypothesis to be disproven that aeroplane would have to be positively identified as Earhart’s Electra,\" he says. \"That has not yet happened, and until it does there is no point in speculating about an Earhart connection.\"\n\nRichard Gillespie, founder of The International Group for Historic Aircraft Recovery, also supports the Nikumaroro theory. Gillespie has led 12 expeditions searching for Earhart's plane and has written several books on the subject. He calls himself the \"leading authority\" on what happened to the aviator and told the BBC, \"We know what happened.",
      "timestamp": "2025-05-24T14:49:56.204506"
    },
    {
      "url": "https://www.history.com/articles/what-happened-to-amelia-9-tantalizing-theories-about-the-earhart-disappearance",
      "content": "By: Elizabeth Hanes Exploration Tantalizing Theories About the Earhart Disappearance Explore theories about Amelia Earhart’s final days—some more plausible than others. EH Elizabeth Hanes The LIFE Picture Collection/Getty Images Published: July 02, 2012 Last Updated: March 06, 2025 Print Copy Theory #1: Earhart ran out of fuel, crashed and perished in the Pacific Ocean. This is one of the most generally accepted versions of the famous aviator’s disappearance. Many experts believe Amelia Earhart and navigator Fred Noonan got slightly off course en route to a refueling stop at Howland Island in the Pacific Ocean. Earhart radioed U.S. Coast Guard ships stationed in the area, reporting that neither she nor Noonan could spot the tiny island where they were supposed to land. According to the so-called “crash-and-sink” theory, the plane eventually ran out of gas and plunged into the ocean, killing both Earhart and Noonan. It then sank, leaving no sign of their whereabouts. 11 Underappreciated World-Changing Women Bet you've never heard of all 11 of these game-changing women and their incredible accomplishments. Theory #2: Earhart landed safely on Gardner Island but died before she could be rescued. In this scenario, Earhart missed her intended Pacific Ocean refueling site, Howland Island, but spotted Gardner Island (now called Nikumaroro), an uninhabited coral atoll nearby. She landed safely but died before she could be rescued. This theory has gained ground in recent years due to the discovery on Nikumaroro of artifacts that could be related to Earhart. Items include an empty jar of the freckle cream she preferred and a piece of Plexiglas similar to that used in the Lockheed Electra airplane she flew. The International Group for Historic Aircraft Recovery (TIGHAR) recently launched its seventh expedition to the island to search for more clues. Theory #3: Earhart’s flight was an elaborate scheme to spy on the Japanese, who captured her after she crashed. Did President Franklin D. Roosevelt enlist Earhart to spy on Japan? If so, the aviator did it in a very roundabout fashion. Earhart’s east-to-west route took her from California to South America, across Africa to India and across the northern tip of Australia en route to a refueling stop at Howland Island in the Pacific Ocean. According to the official account, at least, Earhart never got anywhere close to Japan. Besides, her flight was hardly a secret mission: Newspapers around the world tracked her progress on their front pages. The Earhart-as-spy theory emerged from a 1943 film about Earhart called “Flight for Freedom” and starring Rosalind Russell, but no evidence supports its veracity. Theory #4: Earhart crash-landed, was captured by the Japanese military and died while being held prisoner on the island of Saipan. In 2017, investigators announced the discovery of a photo, buried in the National Archives for nearly 80 years, that may depict Earhart and navigator Fred Noonan days after their disappearance. According to the team, led by former Executive Assistant Director of the FBI Shawn Henry, Earhart crash-landed in the Marshall Islands, was captured by the Japanese military and died while being held prisoner on the island of Saipan. Retired federal agent Les Kinney scoured the archives for records related to the Earhart case, uncovering a photo from the Office of Naval Intelligence (ONI) that shows a ship towing a barge with an airplane on the back; on a nearby dock are several people. Kinney believes the plane on the barge is the Electra, and that two of the people on the dock are Earhart and Noonan. The Marshall Islands/Saipan theory of Earhart’s fate isn’t a new one; it first surfaced back in the 1960s and relies on accounts of Marshall Islanders who supposedly saw the Electra aircraft land and witnessed Earhart and Noonan in Japanese custody. In 2015, Kinney and another amateur Earhart sleuth, Dick Spink, found two metal fragments on Mili atoll in the Marshalls, which they believed came from Earhart’s plane. What Happened to Amelia Earhart? The trailblazing aviator’s disappearance remains a source of fascination—and controversy.",
      "timestamp": "2025-05-24T14:50:00.540755"
    }
  ],
  "search_history": [
    {
      "query": "Amelia Earhart disappearance theories recent discoveries",
      "results": "1. **No title**\n   URL: https://en.wikipedia.org/wiki/Speculation_on_the_disappearance_of_Amelia_Earhart_and_Fred_Noonan\n   Description: \n\n2. **No title**\n   URL: https://www.bbc.com/future/article/20240131-researchers-say-amelia-earharts-long-lost-plane-may-have-just-been-found\n   Description: \n\n3. **No title**\n   URL: https://www.history.com/articles/what-happened-to-amelia-9-tantalizing-theories-about-the-earhart-disappearance\n   Description: \n\n4. **No title**\n   URL: https://www.youtube.com/watch?v=r05K6ilkNCM\n   Description: \n\n5. **No title**\n   URL: https://www.reddit.com/r/watcherentertainment/comments/1cl7r2h/amelia_earhart_case_solved_buzzfeed_unsolved/\n   Description: "
    }
  ],
  "timestamp": "2025-05-24T14:50:09.954404"
}