{
  "search_term": "recent stock purchases by politicians",
  "visited_articles": [
    {
      "url": "https://www.capitoltrades.com/trades",
      "content": "Committee Political Party Congress Chamber Politician State Asset Type Transaction Type Trade Size Market Cap Issuer State Transaction Label Gender Sector Issuer Country\n\nPolitician Traded Issuer Published Traded Filed After Owner Type Size Price Jake Auchincloss Democrat House MA State Street Corporation STT:US 09:05 Today 15 May 2025 days 6 Spouse sell 15K–50K $98.29 Goto trade detail page. Max Miller Republican House OH AIX VENTURES FUND II LP N/A 09:05 Yesterday 7 May 2025 days 14 Undisclosed buy 1K–15K N/A Goto trade detail page. Guy Reschenthaler Republican House PA SOLANA $SOL 21 May 2025 11 May 2025 days 8 Undisclosed sell 1K–15K $174.25 Goto trade detail page. Marjorie Taylor Greene Republican House GA Advanced Micro Devices Inc AMD:US 20 May 2025 13 May 2025 days 5 Undisclosed buy 1K–15K $117.72 Goto trade detail page. Marjorie Taylor Greene Republican House GA Alphabet Inc GOOGL:US 20 May 2025 13 May 2025 days 5 Undisclosed buy 1K–15K $166.81 Goto trade detail page. Marjorie Taylor Greene Republican House GA Amgen Inc AMGN:US 20 May 2025 13 May 2025 days 5 Undisclosed buy 1K–15K $262.28 Goto trade detail page. Marjorie Taylor Greene Republican House GA Blackstone Group Inc BX:US 20 May 2025 13 May 2025 days 5 Undisclosed buy 1K–15K $148.42 Goto trade detail page. Marjorie Taylor Greene Republican House GA Cardinal Health Inc CAH:US 20 May 2025 13 May 2025 days 5 Undisclosed buy 1K–15K $148.41 Goto trade detail page. Marjorie Taylor Greene Republican House GA Chevron Corp CVX:US 20 May 2025 13 May 2025 days 5 Undisclosed buy 1K–15K $141.67 Goto trade detail page. Marjorie Taylor Greene Republican House GA Corning Inc GLW:US 20 May 2025 13 May 2025 days 5 Undisclosed buy 1K–15K $47.01 Goto trade detail page. Marjorie Taylor Greene Republican House GA Dollar General Corporation DG:US 20 May 2025 13 May 2025 days 5 Undisclosed buy 1K–15K $87.70 Goto trade detail page. Marjorie Taylor Greene Republican House GA Eli Lilly and Co LLY:US 20 May 2025 13 May 2025 days 5 Undisclosed buy 1K–15K $715.56 Goto trade detail page. Page 1 of 2910 1 / 2910 Show 12",
      "timestamp": "2025-05-23T16:50:52.612722"
    },
    {
      "url": "https://rady.ucsd.edu/why/news/2025/05-20-congressional-stock-trading-severely-undermines-public-trust-and-compliance-with-the-law.html",
      "content": "HOME Why Rady Rady News 2025 Congressional Stock Trading Severely Undermines Public Trust and Compliance with the Law\n\nCongressional Stock Trading Severely Undermines Public Trust and Compliance with the Law When the voting public is exposed to reports of lawmakers' stock trades, it erodes the perceived legitimacy of Congress across party lines. Greggory DiSalvo / iStock A new study from the Rady School of Management reveals that public exposure to reports of Congressional stock trading significantly reduces Americans’ trust in Congress and their willingness to comply with the law — regardless of political affiliation. The research, published in the Proceedings of the National Academy of Sciences, which was conducted in January 2025, used an online sample of more than 1,000 U.S. citizens. Participants were shown a nonpartisan report with real-world data from watchdog organization Unusual Whales, detailing how certain members of Congress consistently outperformed the stock market. Compared to a control group that received neutral information on the colleges that congress members attended, those exposed to the report were significantly more likely to view Congress as corrupt, self-serving, and less legitimate — and were less willing to follow laws passed by Congress as a result. “We found that simply learning about this kind of trading was enough to erode trust,” said first author Raihan Alam, a doctoral student in management at the Rady School of Management. What was even more striking was that the effect wasn’t about profit. In a follow-up study, the team showed different participants fictional scenarios involving a “Congressman Brown,” who engaged in questionable stock trades. In one version, he made a million dollars. In another, he lost that same amount. Regardless of the outcome, trust plummeted. “This told us something important,” said coauthor Tage Rai, an assistant professor of management at the Rady School of Management. “It’s not just the money. It’s the perception that lawmakers are using their power for personal gain. Even if they fail at it — just the attempt is enough to undermine legitimacy.” First author Raihan Alam, a doctoral student in management at the Rady School of Management and corresponding author Tage Rai, an assistant professor of management at the Rady School of Management, discuss the implications of their study on Congressional stock trading. Cracks in American Exceptionalism Gallup reported in 2024 that trust in Congress had dipped to just 22% and the authors of the paper believe it may be falling even further — especially after recent revelations of trading that occurred on April 9, which raised questions about insider access. For example, Rep. Marjorie Taylor Greene made a $300,000 stock trade a mere 90 minutes before Trump announced he was pausing tariffs on most of the U.S.’ trading partners, after which the stock markets soared. “For years, political scientists have asked why some countries function well and others don’t,” said Rai. “One key difference is public trust in institutions. America used to be the poster child for that — people believed if they played by the rules, the system would work.” A Bipartisan Problem with a Bipartisan Solution The researchers emphasize that the findings have important policy implications. “More than 86% of Democrats and Republicans alike support banning stock trading in Congress,” said Alam. “This is a rare issue where both the public and bipartisan lawmakers are aligned.” Current proposals, such as the Trust in Congress Act, include mandating assets to be placed in blind trusts. The bill earned support from current and former representatives, Katie Porter (D-CA) Matt Gaetz (R-FL), Brian Fitzpatrick (R-PA) and Ro Khanna (D-CA). The researchers suggest such reforms could serve as powerful “credibility-enhancing displays” — costly signals that lawmakers are committed to acting in the public interest. Implications for Democracy The broader message of the research is a warning: declining trust in Congress could translate into declining compliance with the law — a foundational element of democratic governance. “When people no longer believe their leaders are acting fairly, it becomes harder for them to justify following the rules,” said Rai. “That’s not just a political problem.",
      "timestamp": "2025-05-23T16:51:43.685658"
    }
  ],
  "search_history": [
    {
      "query": "Specific Timeframe**: Since the query mentions ",
      "results": "1. **No title**\n   URL: https://docs.splunk.com/Documentation/SCS/current/Search/Specifyingtimeranges\n   Description: \n\n2. **No title**\n   URL: https://learn.microsoft.com/en-us/azure/devops/boards/queries/history-and-auditing?view=azure-devops\n   Description: \n\n3. **No title**\n   URL: https://www.reddit.com/r/azuredevops/comments/ridmcx/query_done_items_state_change/\n   Description: \n\n4. **No title**\n   URL: https://ahima.org/media/51ufzhgl/20221212_acdis_practice-brief.pdf\n   Description: \n\n5. **No title**\n   URL: https://stackoverflow.com/questions/39200312/query-items-user-was-mentioned-in\n   Description: "
    },
    {
      "query": "politicians stock purchases news 2025",
      "results": "1. **No title**\n   URL: https://www.capitoltrades.com/trades\n   Description: \n\n2. **No title**\n   URL: https://www.smartinsider.com/politicians/\n   Description: \n\n3. **No title**\n   URL: https://finance.yahoo.com/news/congressmans-first-stock-trade-tanks-023033205.html\n   Description: \n\n4. **No title**\n   URL: https://unusualwhales.com/politics\n   Description: \n\n5. **No title**\n   URL: https://www.fool.com/investing/2025/05/02/members-of-congress-are-buying-these-4-warren-buff/\n   Description: "
    },
    {
      "query": "politicians stock trades implications 2025",
      "results": "1. **No title**\n   URL: https://rady.ucsd.edu/why/news/2025/05-20-congressional-stock-trading-severely-undermines-public-trust-and-compliance-with-the-law.html\n   Description: \n\n2. **No title**\n   URL: https://campaignlegal.org/update/congressional-stock-trading-and-stock-act\n   Description: \n\n3. **No title**\n   URL: https://www.kpbs.org/news/politics/2025/05/21/ucsd-study-finds-stock-trades-by-congress-ruin-public-faith\n   Description: \n\n4. **No title**\n   URL: https://www.npr.org/2025/05/02/nx-s1-5381400/lawmaker-stock-ban-trump\n   Description: \n\n5. **No title**\n   URL: https://www.propublica.org/article/us-officials-stock-sales-trump-tariffs\n   Description: "
    }
  ],
  "timestamp": "2025-05-23T16:51:56.401883"
}