{
  "search_term": "amelia aerhart disappearence",
  "visited_articles": [
    {
      "url": "https://en.wikipedia.org/wiki/Speculation_on_the_disappearance_of_Amelia_Earhart_and_Fred_Noonan",
      "content": "Article Talk English Read Edit View history Tools Tools move to sidebar hide Actions Read Edit View history General What links here Related changes Upload file Permanent link Page information Cite this page Get shortened URL Download QR code Add interlanguage links Expand all Print/export Download as PDF Printable version In other projects Wikidata item\n\nAppearance move to sidebar hide Text Small Standard Large This page always uses small font size Width Standard Wide The content is as wide as possible for your browser window. Color (beta) Automatic Light Dark This page is always in light mode.\n\nFrom Wikipedia, the free encyclopedia Theories on 1937 disappearance of American aviators This article contains one or more duplicated citations. show The reason given is: DuplicateReferences detected: http://news.discovery.com/history/us-history/aluminum-fragment-appears-to-belong-to-earharts-plane-141028.htm (refs: 33, 34) http://tighar.org/Projects/Earhart/Books/BookReviews/earhartsurvive.html (refs: 61, 62) It is recommended to use named references to consolidate citations that are used multiple times. ( April 2025 ) ( Learn how and when to remove this message ) Amelia Earhart and Fred Noonan Speculation on the disappearance of Amelia Earhart and Fred Noonan has continued since their disappearance in 1937. After the largest search and rescue attempt in history up to that time, the U.S. Navy concluded that Earhart and Noonan ditched at sea after their plane ran out of fuel; this \"crash and sink theory\" is the most widely accepted explanation. However, several alternative hypotheses have been considered. [ 1 ] Theories [ edit ] Gardner Island hypothesis [ edit ] Gardner ( Nikumaroro ) Island in 2014. \"Seven Site\" is a focus of the search for Earhart's remains. The Gardner Island hypothesis assumes that Earhart and Noonan, unable to find Howland Island, would not waste time searching for it, instead turning to the south to look for other islands. The 157/337 radio transmission suggests they flew a course of 157° that would take them past Baker Island; if they missed this, then sometime later they would fly over the Phoenix Islands, now part of the Republic of Kiribati, about 350 nautical miles (650 km) south-southeast of Howland Island. One of the Phoenix Islands, known as Gardner Island (now Nikumaroro), has been the subject of inquiry as a possible crash-landing site. The International Group for Historic Aircraft Recovery ( TIGHAR ) presented a hypothesis that Earhart and Noonan found Gardner Island, uninhabited at the time, landed the Electra on a flat reef near the November 1929 wreck of freighter SS Norwich City, and sent sporadic radio messages from there. [ 2 ] Ric Gillespie, author of Finding Amelia, wrote that while listening to alleged radio signals on their home radios, Mabel Larremore heard a woman claiming to be Earhart say Noonan was \"seriously injured\" and that she had \"some injuries but not as serious as Mr. Noonan's.\" Betty Klenck heard an apparently injured man acting agitated with a distressed woman claiming to be Earhart, and uttering repeatedly what sounded like, \"Marie\". Noonan's wife's first name was Mary Bea. The man said \"Water's knee deep – let me out.\" Klenck heard the woman say, \"George, get the suitcase in my closet...California.\" Four years earlier, in a letter to her mother, Earhart had asked that, should anything ever happen to her, the suitcase of private papers stored in her closet in California be destroyed; George Putnam was her husband. Klenck heard the woman repeatedly say something that sounded like \"New York City\", which has been speculated to have been actually Norwich City, the freighter wreck. A week after Earhart and Noonan disappeared, Navy planes from USS Colorado (which had sailed from Pearl Harbor ) searched Gardner Island. The planes saw signs of recent habitation and the wreck of the SS Norwich City, but no aircraft, and repeated circling failed to bring out any signs of survivors seeking rescue. [ 3 ] TIGHAR theorises that the Electra had by then been washed over the reef edge into the ocean where it broke up and sank.",
      "timestamp": "2025-05-24T14:46:21.315779"
    },
    {
      "url": "https://nypost.com/2025/01/22/us-news/archaeological-legacy-institute-to-embark-on-expedition-to-find-amelia-earharts-long-lost-plane/",
      "content": "Pettigrew believes he located the main body and tail of Earhart's missing aircraft. ArchaeologyChannel.org Earhart disappeared with Noonan on what was to be a record-setting trip around the world in 1937. Bettmann Archive The US Navy and Coast Guard conducted a 16-day search for the missing duo without success, and Earhart was officially declared dead on Jan. 5, 1939. Bettmann Archive Pettigrew said the suspected aircraft was effectively invisible until storm currents uncovered it in 2015. ArchaeologyChannel.org Dr. Richard Pettigrew is the executive director of the Archaeological Legacy Institute in Oregon. ArchaeologyChannel.org You are viewing 1 of 6 images Previous Image Next Image Advertisement\n\nUS News Oregon archaeologist to embark on expedition to find Amelia Earhart’s long-lost plane By Anna Young Published Jan. 22, 2025, 11:33 p.m. ET 38 38 Comments An Oregon-based archaeologist is the latest scientist attempting to find Amelia Earhart’s long-lost plane and solve the baffling 88-year mystery surrounding her and flight navigator Fred Noonan’s disappearances. Dr. Richard Pettigrew, executive director of the Archaeological Legacy Institute in Eugene, has assembled a team of about 10 scientists will launch an expedition this summer to the remote island of Nikumaroro in the western Pacific Ocean to find Earhart’s Lockheed 10-E Electra. After years of acquiring and analyzing satellite, video and drone imagery, Pettigrew believes a metallic and reflective visual anomaly, called the Taraia Object, on the north shore of the Nikumaroro lagoon alongside the Taraia Peninsula is the main body and tail of the missing aircraft. 6 Pettigrew believes he located the main body and tail of Earhart’s missing aircraft. ArchaeologyChannel.org 6 1/1 Skip Ad Continue watching after the ad Visit Advertiser website GO TO PAGE Pettigrew, who has participated in previous expeditions to Nikumaroro, where some believe Earhart landed her plane and died, said he is aware of the “frustrating history” of the decades-long search for the explorers plane. Explore More Sonar image speculated to be Amelia Earhart’s long-lost plane was just a rock: ‘Outcome isn’t what we hoped for’ What would recovery of Amelia Earhart’s long-lost plane look like? What we can learn from Amelia Earhart’s plane if recent sonar image turns out to be 87-year-old wreck As a scientist who considers every piece of evidence, he said his team has a lot of data to support his hypothesis. “Other people have looked and failed but sooner or later someone is going to succeed, and what we have here is maybe the greatest opportunity ever to finally close the case,” he told The Post. “We have a lot of very strong evidence. We’re not going to be able to prove it, of course, until we go there and take a look at it. That’s part of the excitement of what we’re doing. We’d be really excited to come back with proof.” The pioneering female aviator, a household name at the time, disappeared with Noonan, her flight navigator, on what was to be a record-setting trip around the world in 1937. 6 Earhart disappeared with Noonan on what was to be a record-setting trip around the world in 1937. Bettmann Archive The pair set off from Lae, Papua New Guinea, with plans to refuel on Howland Island before continuing their journey to Honolulu and their final destination of Oakland, Calif, but faced a strong headwind in Lae when Earhart’s radio transmissions eventually went silent. The US Navy and Coast Guard conducted a 16-day search for the missing duo without success, and Earhart was officially declared dead on Jan. 5, 1939. 6 The US Navy and Coast Guard conducted a 16-day search for the missing duo without success, and Earhart was officially declared dead on Jan. 5, 1939. Bettmann Archive “The story of Amelia Earhart has implications of significance that goes well beyond just the mystery; her life story is a lesson for all of us,” said Pettigrew, who considers himself an Amelia Earhart aficionado. “It’s an important story for us to remember and an opportunity to learn more about those times.",
      "timestamp": "2025-05-24T14:47:01.342783"
    },
    {
      "url": "https://www.history.com/articles/what-happened-to-amelia-9-tantalizing-theories-about-the-earhart-disappearance",
      "content": "By: Elizabeth Hanes Exploration Tantalizing Theories About the Earhart Disappearance Explore theories about Amelia Earhart’s final days—some more plausible than others. EH Elizabeth Hanes The LIFE Picture Collection/Getty Images Published: July 02, 2012 Last Updated: March 06, 2025 Print Copy Theory #1: Earhart ran out of fuel, crashed and perished in the Pacific Ocean. This is one of the most generally accepted versions of the famous aviator’s disappearance. Many experts believe Amelia Earhart and navigator Fred Noonan got slightly off course en route to a refueling stop at Howland Island in the Pacific Ocean. Earhart radioed U.S. Coast Guard ships stationed in the area, reporting that neither she nor Noonan could spot the tiny island where they were supposed to land. According to the so-called “crash-and-sink” theory, the plane eventually ran out of gas and plunged into the ocean, killing both Earhart and Noonan. It then sank, leaving no sign of their whereabouts. 11 Underappreciated World-Changing Women Bet you've never heard of all 11 of these game-changing women and their incredible accomplishments. Theory #2: Earhart landed safely on Gardner Island but died before she could be rescued. In this scenario, Earhart missed her intended Pacific Ocean refueling site, Howland Island, but spotted Gardner Island (now called Nikumaroro), an uninhabited coral atoll nearby. She landed safely but died before she could be rescued. This theory has gained ground in recent years due to the discovery on Nikumaroro of artifacts that could be related to Earhart. Items include an empty jar of the freckle cream she preferred and a piece of Plexiglas similar to that used in the Lockheed Electra airplane she flew. The International Group for Historic Aircraft Recovery (TIGHAR) recently launched its seventh expedition to the island to search for more clues. Theory #3: Earhart’s flight was an elaborate scheme to spy on the Japanese, who captured her after she crashed. Did President Franklin D. Roosevelt enlist Earhart to spy on Japan? If so, the aviator did it in a very roundabout fashion. Earhart’s east-to-west route took her from California to South America, across Africa to India and across the northern tip of Australia en route to a refueling stop at Howland Island in the Pacific Ocean. According to the official account, at least, Earhart never got anywhere close to Japan. Besides, her flight was hardly a secret mission: Newspapers around the world tracked her progress on their front pages. The Earhart-as-spy theory emerged from a 1943 film about Earhart called “Flight for Freedom” and starring Rosalind Russell, but no evidence supports its veracity. Theory #4: Earhart crash-landed, was captured by the Japanese military and died while being held prisoner on the island of Saipan. In 2017, investigators announced the discovery of a photo, buried in the National Archives for nearly 80 years, that may depict Earhart and navigator Fred Noonan days after their disappearance. According to the team, led by former Executive Assistant Director of the FBI Shawn Henry, Earhart crash-landed in the Marshall Islands, was captured by the Japanese military and died while being held prisoner on the island of Saipan. Retired federal agent Les Kinney scoured the archives for records related to the Earhart case, uncovering a photo from the Office of Naval Intelligence (ONI) that shows a ship towing a barge with an airplane on the back; on a nearby dock are several people. Kinney believes the plane on the barge is the Electra, and that two of the people on the dock are Earhart and Noonan. The Marshall Islands/Saipan theory of Earhart’s fate isn’t a new one; it first surfaced back in the 1960s and relies on accounts of Marshall Islanders who supposedly saw the Electra aircraft land and witnessed Earhart and Noonan in Japanese custody. In 2015, Kinney and another amateur Earhart sleuth, Dick Spink, found two metal fragments on Mili atoll in the Marshalls, which they believed came from Earhart’s plane. What Happened to Amelia Earhart? The trailblazing aviator’s disappearance remains a source of fascination—and controversy.",
      "timestamp": "2025-05-24T14:47:11.312178"
    },
    {
      "url": "https://www.mymcmedia.org/new-developments-in-the-search-for-amelia-earhart-part-1/",
      "content": "I am fortunate to be a member of a team of experienced researchers and explorers who meet via Zoom every month or two to discuss our on-going efforts to solve the disappearance of Amelia Earhart and her navigator, Fred Noonan. In this column back in 2021 I detailed the 3.5 (!) major theories, and since then there have been some interesting developments in the case, which I will discuss below and next month. Deep Sea Vision In January 2024, Tony Romeo and his Deep Sea Vision (DSV) team made headlines around the world when they spotted what they thought might be Amelia Earhart’s Lockheed 10-E Electra in 16,000 feet of seawater (fsw), about 100 miles west of Howland Island, in the north Pacific just above the Equator. Tiny Howland was one of the last destinations for the aviators on their ill-fated 1937 around-the-world flight attempt. DSV is a robotics company based in Charleston, South Carolina, and uses an autonomous underwater vehicle (AUV), the HUGIN 6000. Their HUGIN was called the “Miss Millie Pollywog,” after the nickname “Millie” that Amelia’s family used for her. The impressive AUV can search at depths down to almost 20,000 fsw. When I saw the blurry image made public by DSV (see the photos below), I thought that it was possibly a plane but if it was, it was most likely a swept wing fighter like the North American F-86 Sabers used in the Korean War. Alternatively, I thought it was a natural formation. I knew that the Earhart plane had a very strong main spar that ran 22 feet across the plane from the right to the left engine, through the fuselage, and that two wing breaks right beside the fuselage, as shown in the image, were extremely unlikely. Sure enough, in November 2024 the DSV team revisited the site for a closer look, and concluded that the object was actually a rock formation, not the missing aircraft. To their credit, the DSV team continued to search, covering 1,500 square nautical miles using underwater drones, but did not spot any other anomaly. National Archives and Navy Yard Searches My own searches, conducted at the National Archives I and II in DC and Maryland in 2023 and 2024, were a bit more productive. At NA I in DC I found the logs of the USS Bushnell, which surveyed Gardner Island (now Nikumaroro in the Republic of Kiribati), which may be where Earhart and Noonan landed and survived for one or two weeks. (This theory is largely based on Earhart’s last radio transmission, saying, “We are on the line 157 337.” Extending the 337 degrees line southward hits the Phoenix Islands group, including Gardner/Nikumaroro.) The Bushnell survey took place in 1939, just two years after the disappearance. The logs and associated maps and soundings revealed that the surveyors covered the island’s lagoon in great detail, and were on land too, erecting towers and markers. Thus, they likely would have spotted any large parts of wreckage in the lagoon or on the fringing reef, and might have spotted items left by the wrecked aviators, if indeed they survived there. (Remember, negative evidence is evidence.) In the photo images section at NA II in Maryland I found a photo of a large photo mosaic that had been compiled from excellent, detailed images of Gardner, taken by a USN seaplane launched by the USS Pelican in 1939. The seaplane flew at 8000 feet and took numerous overlapping 8”x 8” negatives of the island. The negatives were then made into positives, and the positives skillfully cut up to remove the overlaps and create a large photo mosaic. This NA photo of the photo mosaic, on a “Confidential” but de-classified card that I found, was clear enough that individual features could be seen, and I was able to take closeups of key areas of interest on the island. A small blurry version of the photo mosaic had previously been found, but in 35 years of searching no other analyst had ever found this useful, clear image.",
      "timestamp": "2025-05-24T14:47:22.606887"
    }
  ],
  "search_history": [
    {
      "query": "Amelia Earhart disappearance theories evidence 2025",
      "results": "1. **No title**\n   URL: https://en.wikipedia.org/wiki/Speculation_on_the_disappearance_of_Amelia_Earhart_and_Fred_Noonan\n   Description: \n\n2. **No title**\n   URL: https://nypost.com/2025/01/22/us-news/archaeological-legacy-institute-to-embark-on-expedition-to-find-amelia-earharts-long-lost-plane/\n   Description: \n\n3. **No title**\n   URL: https://www.history.com/articles/what-happened-to-amelia-9-tantalizing-theories-about-the-earhart-disappearance\n   Description: \n\n4. **No title**\n   URL: https://www.mymcmedia.org/new-developments-in-the-search-for-amelia-earhart-part-1/\n   Description: \n\n5. **No title**\n   URL: https://www.bbc.com/future/article/20240131-researchers-say-amelia-earharts-long-lost-plane-may-have-just-been-found\n   Description: "
    }
  ],
  "timestamp": "2025-05-24T14:47:36.007565"
}