{
  "search_term": "trump news",
  "visited_articles": [
    {
      "url": "https://www.usatoday.com/story/news/politics/2025/05/23/trump-approval-rating-polls/83817860007/",
      "content": "More Stories Was Barron Trump rejected by Harvard? Here's what to know news Undo Man dies in explosion on boat in Hudson River in New York City news Undo Hollywood Celebritys Fired for Leaks This Weight Loss Trick Health News | Ad Ad Undo\n\n0:07 / 1:00 President Donald Trump 's average approval rating largely held steady this week, with polling placing him between three and five points underwater. A Friday, May 23 average of recent polls from the New York Times gives the second-term president a 45% approval rating, with 51% disapproving of his performance. The outlet's approval rating average has held steady between 44%-45% over the last 30 days, but it does show a downward trend for the president since early March. Pollster Nate Silver's \"Silver Bulletin\" newsletter showed the president reached his best approval figures since early April this week, settling in with a 46% approval and 50% disapproval on May 23. RealClearPolitics' average was more than a percentage point higher, calculating a 47.7% approval and 49.3% disapproval rating. Polling: More Americans oppose Trump's tax plan than support it, survey says Trump began his term with a 47% approval rating, according to Gallup, and saw his popularity dip through his 100th day in office, when his job approval numbers reached historic lows not seen by any other president over the past several decades. While his lowest average approval numbers sank to the low-40s, the Republican leader has seen a slight uptick in approval rating metrics since late April. His highest average, Gallup's analysis says, is 49%, just shy of that benchmark. A historical analysis by Gallup shows Trump's approval ratings in April 2017 and April 2025 − roughly marking his first 100 days in office − reached lows unseen by any other modern president. Trump news recap In the past week, Trump told Walmart to \"eat the tariffs\" after the company said it would increase prices due to the president's higher import duties, and he signed a law aimed at combatting revenge porn and deep fakes. The Republican leader also presented disinformation to South African President Cyril Ramaphosa to further a right-wing conspiracy that the country is committing genocide against White farmers, and the U.S. House of Representatives passed a piece of mega-legislation dubbed the \"Big Beautiful Bill\" by the president for its Republican-backed legislative priorities. Here are the latest polls on Trump's approval rating. YouGov poll 43% approve 51% disapprove The survey of 1,710 U.S. adults was conducted May 16-20 and has a margin of error of ±3.2 percentage points. Morning Consult poll 48% approve 50% disapprove The survey of 2,208 registered voters was conducted May 16-19 and has a margin of error of ±2 percentage points. Gallup poll 43% approve 53% disapprove The survey of 1,003 U.S. adults was conducted May 1-18 and has a margin of error of ±4 percentage points. Reuters/Ipsos poll 42% approve 52% disapprove The survey of 1,024 U.S. adults was conducted May 16-18 and has a margin of error of ±3.3 percentage points. Shooting victim Sarah Milgrim remembered as 'a light' who fought antisemitism Uncharted territory: US accepts 'gift' of $400 million Qatari plane Download USA TODAY's app to get to the heart of news Trump's tax policy bill clears the House. Next up: An opinionated Senate Trump administration says Harvard can no longer enroll international students Trump's image of dead 'White farmers' from Reuters footage in Congo, not South Africa Marquette Law School poll 46% approve 54% disapprove The survey of 1,004 U.S. adults was conducted May 5-15 and has a margin of error of ±3.6 percentage points. Kathryn Palmer is a trending news reporter for USA TODAY. You can reach her at kapalmer@usatoday.com and on X @ KathrynPlmr.\n\nSeniors Can Now Fly Business Class For the Price Of Economy Americans, you'll want to check this out ASAP Insider | Travel Deals | Ad Ad Undo Hollywood Actress Leaks",
      "timestamp": "2025-05-24T14:53:32.598202"
    }
  ],
  "search_history": [
    {
      "query": "latest news on Donald Trump May 2025",
      "results": "1. **No title**\n   URL: https://www.youtube.com/watch?v=O9rCTRL6vmQ\n   Description: \n\n2. **No title**\n   URL: https://www.whitehouse.gov/videos/president-trump-signs-executive-orders-in-the-oval-office-may-23-2025/\n   Description: \n\n3. **No title**\n   URL: https://www.youtube.com/watch?v=hyULwVCcgJw\n   Description: \n\n4. **No title**\n   URL: https://www.pbs.org/newshour/politics/watch-trump-delivers-commencement-speech-to-west-point-graduating-class-of-2025\n   Description: \n\n5. **No title**\n   URL: https://www.usatoday.com/story/news/politics/2025/05/23/trump-approval-rating-polls/83817860007/\n   Description: "
    }
  ],
  "timestamp": "2025-05-24T14:53:36.017175"
}