{
  "search_term": "tesla stock",
  "visited_articles": [
    {
      "url": "https://www.nasdaq.com/market-activity/stocks/tsla",
      "content": "TSLA Summary Quotes Summary Real-Time After-Hours Pre-Market Charts News & Analysis News Press Releases Dividend History Historical Quotes Historical NOCP Financials Earnings P/E & PEG Ratios Option Chain Short Interest Institutional Holdings Insider Activity SEC Filings Revenue EPS More Quotes Summary Real-Time After-Hours Pre-Market Charts News & Analysis News Press Releases Dividend History Historical Quotes Historical NOCP Financials Earnings P/E & PEG Ratios Option Chain Short Interest Institutional Holdings Insider Activity SEC Filings Revenue EPS Portfolio Watchlist Breadcrumb Tesla, Inc. Common Stock (TSLA) 1D 5D 1M 6M YTD 1Y 5Y MAX 6 AM 9 AM 12 PM 3 PM 6 PM 332.5 335 337.5 340 342.5 345 347.5 350 Previous Close Real time quote data is not available at this time. May 24, 2025 Data is currently not available Ad Scroll with content Key Data Data is currently not available Key data is currently not available. Data Disclaimer: The Nasdaq Indices and the Major Indices are delayed at least 1 minute. Bid Price and Ask Price The bid & ask refers to the price that an investor is willing to buy or sell a stock. The bid is the highest amount that a buyer is currently willing to pay, whereas the ask is the lowest amount that a seller is currently willing to sell. The numbers next to the bid/ask are the “ size ”. The bid size displays the total amount of desired shares... Read More. to buy at that price, and the ask size is the number of shares offered for sale at that price. The data displayed in the quote bar updates every 3 seconds; allowing you to monitor prices in real-time. The bid-ask spread can indicate a stock’s liquidity, which is how easy it is to buy and sell in the marketplace. Often, a smaller spread suggests higher liquidity, meaning more buyers and sellers in the market are willing to negotiate. In contrast, a larger spread suggests lower liquidity, as there are fewer investors willing to negotiate. You can use the bid-ask spread to determine whether to place a market order or limit order when trading, helping you to optimize your price and have a successful order execution. Real-time bid and ask information is powered by Nasdaq Basic, a premier market data solution. This data feed is available via Nasdaq Data Link APIs; to learn more about subscribing, visit Learn More About Nasdaq Basic.... Read Less. Label Value Powered by Nasdaq Basic Data is currently not available *Data is provided by Barchart.com. Data reflects weightings calculated at the beginning of each month. Data is subject to change. **Green highlights the top performing ETF by % change in the past 100 days. Summary Real-Time After-Hours Pre-Market Charts News Press Releases Dividend History Historical Quotes Historical NOCP Financials Earnings P/E & PEG Ratios Option Chain Short Interest Institutional Holdings Insider Activity SEC Filings Revenue EPS Symbol Search Screener -> Explore Nasdaq's Premier Data Solutions Recently Viewed Data is currently not available Latest News This data feed is not available at this time. Data is currently not available • Show: 10... 1-10 of 100 Trending Stocks Trending ETFs Trending Indexes Data Disclaimer: The Nasdaq Indices and the Major Indices are delayed at least 1 minute. Real-time Data is provided using Nasdaq Last Sale Data Data provided by Nasdaq Data Link, a premier source for financial, economic and alternative datasets. Data Link's cloud-based technology platform allows you to search, discover and access data and analytics for seamless integration via cloud APIs. Register for your free account today at data.nasdaq.com. Powered by Nasdaq Data Link\n\nThis data feed is not available at this time. Data is currently not available • Show: 10... 1-10 of 100\n\nMy Quotes My European Quotes Watchlist Portfolio Add/Edit Symbols View as Table Add symbols now or see the quotes that matter to you, anywhere on Nasdaq.com. Start browsing Stocks, Funds, ETFs and more asset classes. 1 / 2 TSLA $339.34 -1.70 -0.50% Add/Edit Instruments View as Table Add instruments now or see the quotes that matter to you, anywhere on Nasdaq.com.",
      "timestamp": "2025-05-24T13:59:11.109646"
    }
  ],
  "search_history": [
    {
      "query": "insights from financial analysts regarding Tesla",
      "results": "1. **No title**\n   URL: https://www.nasdaq.com/articles/insights-tesla-tsla-q1-wall-street-projections-key-metrics#:~:text=In%20its%20upcoming%20report%2C%20Tesla,%2Dyear%20increase%20of%202.6%25.\n   Description: \n\n2. **No title**\n   URL: https://www.investopedia.com/articles/markets/052316/tesla-stock-capital-structure-analysis-tsla.asp\n   Description: \n\n3. **No title**\n   URL: https://finance.yahoo.com/quote/TSLA/analysis/\n   Description: \n\n4. **No title**\n   URL: https://www.marketwatch.com/story/tesla-has-a-rosy-ai-future-to-this-analyst-but-tariff-worries-are-weighing-on-the-stock-885c10b1\n   Description: \n\n5. **No title**\n   URL: https://www.stocktargetadvisor.com/blog/tesla-stock-forecast-analysis-a-deep-dive-into-analyst-expectations-and-ai-powered-insights/\n   Description: "
    },
    {
      "query": "current Tesla stock price May 2025",
      "results": "1. **No title**\n   URL: https://finance.yahoo.com/quote/TSLA/history/\n   Description: \n\n2. **No title**\n   URL: https://www.macrotrends.net/stocks/charts/TSLA/tesla/stock-price-history\n   Description: \n\n3. **No title**\n   URL: https://www.cnn.com/markets/stocks/TSLA\n   Description: \n\n4. **No title**\n   URL: https://coincodex.com/stock/TSLA/price-prediction/\n   Description: \n\n5. **No title**\n   URL: https://www.nasdaq.com/market-activity/stocks/tsla\n   Description: "
    }
  ],
  "timestamp": "2025-05-24T13:59:18.545569"
}