{
  "search_term": "telsa stock price",
  "visited_articles": [
    {
      "url": "https://finance.yahoo.com/quote/TSLA/",
      "content": "Invest more confidently Turn volatility into opportunity with weekly stock picks, portfolio risk analysis, and more. Upgrade now\n\n1D 5D -2.31% 1M 36.35% 6M -3.03% YTD -15.34% 1Y 96.78% 5Y 527.79% All 26,890.91% Key Events Mountain Advanced Chart Loading Chart for TSLA (left-click to pin tooltip) ( right-click to delete right-click to manage ) (long-press to drag) ( drag to change anchor time ) TSLA Analyst Rating Date May 23, 2025 Analyst Wedbush Rating Action Maintains Rating Outperform Price Action Raises Price Target 350 -> 500 Date Close Open High Low Volume\n\nPrevious Close 341.04 Open 337.52 Bid 336.00 x 200 Ask 341.93 x 100 Day's Range 333.21 - 341.91 52 Week Range 167.41 - 488.54 Volume 57,906,974 Avg. Volume 125,270,674 Market Cap (intraday) 1.101T Beta (5Y Monthly) 2.43 PE Ratio (TTM) 196.49 EPS (TTM) 1.74 Earnings Date Jul 21, 2025 - Jul 25, 2025 Forward Dividend & Yield -- Ex-Dividend Date -- 1y Target Est 299.38\n\nPeople Also Watch AAPL Apple Inc. 196.47 -2.43% AMZN Amazon.com, Inc. 201.83 -0.63% META Meta Platforms, Inc. 631.93 -0.73% GOOG Alphabet Inc. 171.00 -0.57% NVDA NVIDIA Corporation 131.72 -0.84% NFLX Netflix, Inc. 1,189.23 +0.11% MSFT Microsoft Corporation 452.34 -0.55% AMD Advanced Micro Devices, Inc. 110.44 -0.24% DIS The Walt Disney Company 110.18 -0.86% BA The Boeing Company 202.17 -0.61% INTC Intel Corporation 20.15 -1.97% BABA Alibaba Group Holding Limited 120.81 -0.55% PLTR Palantir Technologies Inc. 124.35 +1.68% NIO NIO Inc. 3.8099 -1.81% F Ford Motor Company 10.37 -0.72% JPM JPMorgan Chase & Co. 261.09 +0.16%\n\n1D 5D -2.31% 1M 36.35% 6M -3.03% YTD -15.34% 1Y 96.78% 5Y 527.79% All 26,890.91%\n\nLoading Chart for TSLA (left-click to pin tooltip) ( right-click to delete right-click to manage ) (long-press to drag) ( drag to change anchor time ) TSLA Analyst Rating Date May 23, 2025 Analyst Wedbush Rating Action Maintains Rating Outperform Price Action Raises Price Target 350 -> 500 Date Close Open High Low Volume\n\nTesla, Inc. Overview Auto Manufacturers / Consumer Cyclical Tesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive; and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits; and non-warranty after-sales vehicle, used vehicles, body shop and parts, supercharging, retail merchandise, and vehicle insurance services. This segment also provides sedans and sport utility vehicles through direct and used vehicle sales, a network of Tesla Superchargers, and in-app upgrades; purchase financing and leasing services; services for electric vehicles through its company-owned service locations and Tesla mobile service technicians; and vehicle limited warranties and extended service plans. The Energy Generation and Storage segment engages in the design, manufacture, installation, sale, and leasing of solar energy generation and energy storage products, and related services to residential, commercial, and industrial customers and utilities through its website, stores, and galleries, as well as through a network of channel partners. This segment also provides services and repairs to its energy product customers, including under warranty; and various financing options to its residential customers. The company was formerly known as Tesla Motors, Inc. and changed its name to Tesla, Inc. in February 2017. Tesla, Inc. was incorporated in 2003 and is headquartered in Austin, Texas. www.tesla.com 125,665 Full Time Employees December 31 Fiscal Year Ends Consumer Cyclical Sector Auto Manufacturers Industry More about Tesla, Inc.\n\nBig Tech's spending drove Nvidia's rise Yahoo Finance • 1 hour ago China's BYD tops Tesla for first time ever in Europe Yahoo Finance • 20 hours ago Magnificent Seven Stocks: Apple Extends Losing Streak; Nvidia, Tesla Slide Investor's Business Daily • 28 minutes ago Elon Musk to Nvidia Rescue With Massive GPU Orders Insider Monkey • 34 minutes ago Why Wedbush Is Back Among the Street's Top Tesla Stock Bulls Investopedia • 49 minutes ago Tesla Slides as Grok Rolls Into Federal",
      "timestamp": "2025-05-24T13:59:42.545277"
    }
  ],
  "search_history": [
    {
      "query": "the latest stock price of Tesla, ensuring that I get the most up-to-date information since stock prices can fluctuate frequently.",
      "results": "1. **No title**\n   URL: https://www.nasdaq.com/market-activity/stocks/tsla\n   Description: \n\n2. **No title**\n   URL: https://www.cnbc.com/quotes/TSLA\n   Description: \n\n3. **No title**\n   URL: https://finance.yahoo.com/quote/TSLA/\n   Description: \n\n4. **No title**\n   URL: https://public.com/stocks/tsla\n   Description: \n\n5. **No title**\n   URL: https://www.cnn.com/markets/stocks/TSLA\n   Description: "
    }
  ],
  "timestamp": "2025-05-24T13:59:51.473910"
}