{
  "search_term": "what happened amelia airheat",
  "visited_articles": [
    {
      "url": "https://en.wikipedia.org/wiki/Amelia_Earhart",
      "content": "Article Talk English Read View source View history Tools Tools move to sidebar hide Actions Read View source View history General What links here Related changes Upload file Permanent link Page information Cite this page Get shortened URL Download QR code Edit interlanguage links Expand all Print/export Download as PDF Printable version In other projects Wikimedia Commons Wikiquote Wikisource Wikidata item\n\nAppearance move to sidebar hide Text Small Standard Large This page always uses small font size Width Standard Wide The content is as wide as possible for your browser window. Color (beta) Automatic Light Dark This page is always in light mode.\n\nFrom Wikipedia, the free encyclopedia American aviation pioneer and author (1897–1937) \"Earhart\" redirects here. For other uses, see Earhart (disambiguation) and Amelia Earhart (disambiguation). Amelia Earhart Earhart beneath the nose of her Lockheed Model 10-E Electra, March 1937 in Oakland, California, before departing on her final round-the-world attempt prior to her disappearance Born Amelia Mary Earhart ( 1897-07-24 ) July 24, 1897 Atchison, Kansas, U.S. Disappeared July 2, 1937 (aged 39) Pacific Ocean, en route to Howland Island from Lae, New Guinea Status Declared dead in absentia [ 1 ] ( 1939-01-05 ) January 5, 1939 Occupations Aviator author Known for Many early aviation records, including first woman to fly solo across the Atlantic Ocean Spouse George P. Putnam ​ ( m. 1931 ) ​ Awards Distinguished Flying Cross Légion d'honneur National Aviation Hall of Fame National Women's Hall of Fame Website www.ameliaearhart.com Signature Amelia Mary Earhart ( / ˈ ɛər h ɑːr t / AIR -hart; born July 24, 1897; disappeared July 2, 1937; declared dead January 5, 1939) was an American aviation pioneer. On July 2, 1937, she disappeared over the Pacific Ocean while attempting to become the first female pilot to circumnavigate the world. During her life, Earhart embraced celebrity culture and women's rights, and since her disappearance has become a global cultural figure. She was the first female pilot to fly solo non-stop across the Atlantic Ocean and set many other records. [ 2 ] She was one of the first aviators to promote commercial air travel, wrote best-selling books about her flying experiences, and was instrumental in the formation of The Ninety-Nines, an organization for female pilots. [ 3 ] Earhart was born and raised in Atchison, Kansas, and developed a passion for adventure at a young age, steadily gaining flying experience from her twenties. In 1928, she became a celebrity after becoming the first female passenger to cross the Atlantic by airplane. In 1932, she became the first woman to make a nonstop solo transatlantic flight, and was awarded the Distinguished Flying Cross for her achievement. [ 4 ] In 1935, she became a visiting faculty member of Purdue University as an advisor in aeronautical engineering and a career counselor to female students. She was a member of the National Woman's Party and an early supporter of the Equal Rights Amendment. [ 5 ] [ 6 ] She was one of the most inspirational American figures from the late 1920s and throughout the 1930s. Her legacy is often compared to that of the early career of pioneer aviator Charles Lindbergh, as well as First Lady Eleanor Roosevelt, for their close friendship and lasting influence on women's causes. In 1937, during an attempt to become the first woman to complete a circumnavigational flight of the globe, flying a Lockheed Model 10-E Electra airplane, Earhart and her navigator Fred Noonan disappeared near Howland Island in the central Pacific Ocean. The two were last seen in Lae, New Guinea, their last land stop before Howland Island, a very small location where they were intending to refuel. It is generally believed that they ran out of fuel before they found Howland Island and crashed into the ocean near their destination. [ 7 ] Nearly one year and six months after she and Noonan disappeared, Earhart was officially declared dead. The mysterious nature of Earhart's disappearance has caused much public interest in her life.",
      "timestamp": "2025-05-24T14:43:27.297274"
    },
    {
      "url": "https://www.history.com/this-day-in-history/july-2/amelia-earhart-disappears",
      "content": "JUL 02 JUL 02 Choose another date OK July 30 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 1 2 3 By: HISTORY.com Editors 1937 Amelia Earhart disappears HISTORY.com Editors Published: February 09, 2010 Last Updated: January 31, 2025 Print Copy On July 2, 1937, the Lockheed aircraft carrying American aviator Amelia Earhart and navigator Frederick Noonan is reported missing near Howland Island in the Pacific. The pair were attempting to fly around the world when they lost their bearings during the most challenging leg of the global journey: Lae, New Guinea, to Howland Island, a tiny island 2,227 nautical miles away, in the center of the Pacific Ocean. The U.S. Coast Guard cutter Itasca was in sporadic radio contact with Earhart as she approached Howland Island and received messages that she was lost and running low on fuel. Soon after, she probably tried to ditch the Lockheed in the ocean. No trace of Earhart or Noonan was ever found. What Happened to Amelia Earhart? Jacqui Rossi details Amelia Earhart's trajectory from baby tomboy in Kansas to the world's foremost aviatrix. Amelia Earhart was born in Atchison, Kansas, in 1897. She took up aviation at the age of 24 and later gained publicity as one of the earliest female aviators. In 1928, the publisher George P. Putnam suggested Earhart become the first woman to fly across the Atlantic Ocean. The previous year, Charles A. Lindbergh had flown solo nonstop across the Atlantic, and Putnam had made a fortune off Lindbergh’s autobiographical book We. In June 1928, Earhart and two men flew from Newfoundland, Canada, to Wales, Great Britain. Although Earhart’s only function during the crossing was to keep the plane’s log, the flight won her great fame, and Americans were enamored of the daring young pilot. The three were honored with a ticker-tape parade in New York, and “Lady Lindy,” as Earhart was dubbed, was given a White House reception by President Calvin Coolidge. Earhart wrote a book about the flight for Putnam, whom she married in 1931, and gave lectures and continued her flying career under her maiden name. On May 20, 1932, she took off alone from Newfoundland in a Lockheed Vega on the first solo nonstop transatlantic flight by a woman. She was bound for Paris but was blown off course and landed in Ireland on May 21 after flying more than 2,000 miles in just under 15 hours. It was the fifth anniversary of Lindbergh’s historic flight, and before Earhart no one had attempted to repeat his solo transatlantic flight. For her achievement, she was awarded the Distinguished Flying Cross by Congress. Three months later, Earhart became the first woman to fly solo nonstop across the continental United States. In 1935, in the first flight of its kind, she flew solo from Wheeler Field in Honolulu to Oakland, California, winning a $10,000 award posted by Hawaiian commercial interests. Later that year, she was appointed a consultant in careers for women at Purdue University, and the school bought her a modern Lockheed Electra aircraft to be used as a “flying laboratory.” On March 17, 1937, she took off from Oakland and flew west on an around-the-world attempt. It would not be the first global flight, but it would be the longest–29,000 miles, following an equatorial route. Accompanying Earhart in the Lockheed was Frederick Noonan, her navigator and a former Pan American pilot. After resting and refueling in Honolulu, the pair prepared to resume the flight. However, while taking off for Howland Island, Earhart ground-looped the plane on the runway, perhaps because of a blown tire, and the Lockheed was seriously damaged. The flight was called off, and the aircraft was shipped back to California for repairs. In May, Earhart flew the newly rebuilt plane to Miami, from where Noonan and she would make a new around-the-world attempt, this time from west to east.",
      "timestamp": "2025-05-24T14:43:36.354461"
    },
    {
      "url": "https://www.usni.org/magazines/naval-history-magazine/2000/august/earhart-tragedy-old-mystery-new-hypothesis",
      "content": "The Earhart Tragedy: Old Mystery, New Hypothesis Amelia Earhart and Fred Noonan disappeared over the Pacific in 1937 while attempting to fly around the world—and their story continues to intrigue researchers and the public alike. The author details evidence indicating that official actions may have contributed to the mystery. By John P. Riley Jr. August 2000 Naval History Volume 14 Number 4 Featured Article View Issue Facebook Twitter Reddit Email Share Comments Over the decades since Amelia Earhart and Fred Noonan disappeared in the Pacific Ocean on 2 July 1937 while attempting to fly around the world, many authors have focused on the fliers’ alleged incompetence as the reason they did not find Howland Island. Earhart, despite having achieved numerous aviation firsts, often is portrayed as unqualified, even though she was the first woman to fly the Atlantic Ocean and the first person of either sex to fly from Hawaii to the mainland of North America. Critics say that Noonan, although without question a top-flight navigator, was a hopeless alcoholic who was either drunk or hung over when most needed. Captain Almon Gray, U.S. Naval Reserve (Retired), who was Assistant Communications Superintendent for Pan American Airways’ Pacific Division when he left to go on active duty in 1942, knew Fred Noonan well and flew with him a number of times in the Pan Am Clippers. Gray told me that Noonan always showed up for a flight precisely on time but usually looking a bit hung over. Once aloft he would have some coffee and then do a superb job of navigation. He never drank during a flight. Unknown to many researchers, Noonan held a second class Commercial Radiotelegraph License, which he obtained two years before his death, and he often stood by for the Clippers’ radio operators when needed. They worked in CW (continuous wave, i.e., Morse code) exclusively. People flocked to Lae when Amelia Earhart and navigator Fred Noonan passed through. Left to right: L. J. Joubert of Bulolo Gold Dredging, Ltd.; Mrs. Joubert; Mrs. F. C. Jacobs; Earhart; F. C. Jacobs of New Guinea Goldfields, Ltd.; and Noonan. Tommie O’Dea, General Manager of Guinea Airways, took the photograph—one of the last images of the two fliers before they launched for Howland Island. In the background is the aircraft with the direction-finding loop antenna and the stub mast antenna clearly visible aft of the cockpit. Thomas J. Ringers In contrast with the sniping at the Earhart-Noonan team, Commander Warner K. Thompson, U.S. Coast Guard, commanding the USCGC Itasca (WPG-321)—the vessel waiting at Howland Island to guide her in—has received lavish praise. Consider what the Commandant, 14th Naval District, reported at the time to the Chief of Naval Operations: “Commander W. K. Thompson, USCG, has been commended by letter to his immediate superior. His intelligent and zealous conduct of the initial phase of the search under most trying conditions deserves especial commendation. His reports, together with the wholehearted cooperation of the Commander, Hawaiian Section, U. S. Coast Guard, were of great assistance to the subsequent conduct of operations by the Navy. The performance of the ITASCA was excellent in all respects throughout the flight and the search. Careful study of all communications and other information pertaining to the flight and the preparations therefor indicate clearly that ITASCA left nothing undone to insure the safe completion of the Earhart flight.” Many investigating the disappearance probably took this at face value and directed their attention elsewhere. I saw it as military service politesse, however. Generous letters of commendation are an old tradition in all fighting forces—but they can distort history. A detailed examination of Commander Thompson’s performance reveals a different story. Far from acting intelligently and zealously, he must have so embarrassed then-Rear Admiral R. R. Waesche, Commandant of the Coast Guard, and Secretary of the Treasury Henry Morgenthau, Jr.—to whom the service then reported—that they thought it best the facts remain undisclosed. Admiral Russell Waesche was the Commandant of the Coast Guard from 1936 to 1945. U.S.",
      "timestamp": "2025-05-24T14:43:50.001508"
    }
  ],
  "search_history": [
    {
      "query": "Amelia Earhart disappearance",
      "results": "1. **No title**\n   URL: https://www.usni.org/magazines/naval-history-magazine/2000/august/earhart-tragedy-old-mystery-new-hypothesis#:~:text=Amelia%20Earhart%20and%20Fred%20Noonan,have%20contributed%20to%20the%20mystery.\n   Description: \n\n2. **No title**\n   URL: https://www.britannica.com/story/the-disappearance-of-amelia-earhart\n   Description: \n\n3. **No title**\n   URL: https://en.wikipedia.org/wiki/Amelia_Earhart\n   Description: \n\n4. **No title**\n   URL: https://www.history.com/this-day-in-history/july-2/amelia-earhart-disappears\n   Description: \n\n5. **No title**\n   URL: https://airandspace.si.edu/stories/editorial/legend-amelia-earharts-disappearance\n   Description: "
    }
  ],
  "timestamp": "2025-05-24T14:43:58.451317"
}