{
  "search_term": "defcon event dates 2025",
  "visited_articles": [
    {
      "url": "https://defcon.org/",
      "content": "Truth is a complete defense against defamation. The Hadnagy lawsuit against us is over. Summary judgement. Dismissed, with prejudice. We look forward to returning our full attention to the community and conference we love. We also thank everyone who came forward to help keep our community safe. We know it's not an easy choice, but the world is better for it. This victory is encouraging. We hope it makes attendees feel safe reporting CoC violations. We hope it demonstrates our commitment to protecting attendees from misconduct. Mostly, we hope our amazing community will continue looking out for each other. We will always have your back. You can read the judgment here. Stay tuned for a more detailed report.\n\nWe sense a disturbance in the force… registration is open for DEF CON Training Las Vegas 2025! Whether you're a Rebel Red Teamer or a True Blue Defender, there is training for all, from any world in the galaxy! Pack up your droids and join us in Vegas! Register today and take advantage of this opportunity to train with our Jedi Masters - uh, we mean instructors.\n\nDC33 planning alert - The DEF CON room block at the Fontainebleau is sold out. The blocks at the Sahara and Venetian are filling up. To lock down your own deep DEF CON 33 discounts visit defcon.org for the reg links. August will be here before you know it. Make sure you plan accordingly. See you soon!\n\nAttention independent authors! DEF CON 33 is offering a space for book signings in the Vendor area. If you've got a book that will appeal to the DEF CON Community, we encourage you to submit it for consideration. Get your work (and yourself) in front of a vibrant, engaged community of enthusiastic readers.\n\nAttention all scribes and tale-weavers of the DEF CON community - the DEF CON 33 Short Story Contest is open for business! It takes place entirely online - you can find the details at https://forum.defcon.org/node/252691. The theme is Access Everywhere. In addition to literary glory, you can also win free human badges for DC33. let's GO.\n\nSpring has sprung. Birds are singing, flower buds are budding and the DEF CON 33 website is open for business. Bookmark it for all the latest info on everything DC33. August will be here before you know it and you'll want to be in the loop as things develop. Stay in touch, and we'll see you there.\n\nFriendly DEF CON reminder: the deadline for the DEF CON 33 Call for Papers, Call for Workshops and Call for Demo Labs is now less than a month away! Get your submissions in ahead of the mad rush at the May 1 deadline for maximum attention. We can't wait to see what you're working on.\n\nDEF CON Training Las Vegas Registration is officially open! Expanded menu includes dozens of course options, new 4-day trainings and a $200 earlybird discount. Join us in August for DEF CON style hands-on technical training from our world-class trainers. Information and signup at training.defcon.org. Reserve your spot now!\n\nFriendly reminder to DEF CON people everywhere 🚨 The open calls for DEF CON 33 Contests, Villages and Communities close March 15. If you've got a cool idea to propose, now is the time! Fortune favors the bold. Let's GO.\n\n\"Access Everywhere.\" This year we're thinking about how to make information and services available to everyone. Available wherever you are, whoever you are, and usable no matter how you need to connect. Less walled gardens, more sunlight. You can read the theme story and get some visual inspiration on the DEF CON 33 Theme and Style Guide page. You can get it in a PDF on media.defcon.org. Homework assignments to get you into the vibe coming soon. We can't wait to see where you'll take it. See you at DEF CON!\n\nDEF CON 33 is building steam. Planning is in full swing. In fact, a glance at any nearby calendar will tell you we're already halfway there! We know you need to plan, too.",
      "timestamp": "2025-05-23T16:54:11.160863"
    }
  ],
  "search_history": [
    {
      "query": "DEF CON 2025 event dates",
      "results": "1. **No title**\n   URL: https://openssf.org/event/def-con-2025/#:~:text=August%207%20%2D%20August%2010&text=DEF%20CON%20is%20one%20of,also%20one%20of%20the%20largest.\n   Description: \n\n2. **No title**\n   URL: https://defcon.org/\n   Description: \n\n3. **No title**\n   URL: https://www.blackhat.com/us-25/defcon.html\n   Description: \n\n4. **No title**\n   URL: https://x.com/defcon\n   Description: \n\n5. **No title**\n   URL: https://10times.com/defcon-lasvegas\n   Description: "
    }
  ],
  "timestamp": "2025-05-23T16:54:17.051739"
}