{
  "search_term": "best stocks to buy may 2025",
  "visited_articles": [
    {
      "url": "https://www.investors.com/research/best-stocks-to-buy-now/",
      "content": "Buying a stock is easy, but buying the right stock without a time-tested strategy is incredibly hard. So what are the best stocks to buy now or put on a watchlist? Booking ( BKNG ), Broadcom ( AVGO ), Boston Scientific ( BSX ), TJX ( TJX ) and EQT ( EQT ) are prime candidates. The market confounded expectations for difficulties and turned in an outstanding performance in 2023 and 2024. Donald Trump's election victory initially boosted stocks, but they then got walloped due to the Trump administration's tariff agenda. The market has now come off lows, however, as Trump has eased tariffs, at least temporarily. The Federal Reserve outlook is unclear amid elevated inflation and Trump policy uncertainty. ↑ X More Videos 0 seconds of 0 seconds Volume 0% Press shift question mark to access a list of keyboard shortcuts Keyboard Shortcuts Enabled Disabled Shortcuts Open/Close / or? Play/Pause SPACE Increase Volume ↑ Decrease Volume ↓ Seek Forward → Seek Backward ← Captions On/Off c Fullscreen/Exit Fullscreen f Mute/Unmute m Decrease Caption Size - Increase Caption Size + or = Seek % 0-9 Next Up Car Prices Set To Surge On Trump Tariffs: What You Need To Know 03:43 Subtitle Settings Off english Font Color White Font Opacity 100% Font Size 100% Font Family sans-serif Character Edge None Edge Color Black Background Color Black Background Opacity 75% Window Color Black Window Opacity 0% Reset White Black Red Green Blue Yellow Magenta Cyan 100% 75% 50% 25% 200% 175% 150% 125% 100% 75% 50% Arial Courier Georgia Impact Lucida Console Tahoma Times New Roman Trebuchet MS Verdana None Raised Depressed Uniform Drop Shadow White Black Red Green Blue Yellow Magenta Cyan White Black Red Green Blue Yellow Magenta Cyan 100% 75% 50% 25% 0% White Black Red Green Blue Yellow Magenta Cyan 100% 75% 50% 25% 0% 0.5x 1x 1.25x 1.5x 2x Live 00:00 00:00 00:00 Key Bullish Signal Marks This Shift In Approach; NRG, Dutch Bros, Royal Caribbean In Focus See All Videos NOW PLAYING Key Bullish Signal Marks This Shift In Approach; NRG, Dutch Bros, Royal Caribbean In Focus Best Stocks To Buy: The Crucial Ingredients Remember, there are thousands of stocks trading on the NYSE and Nasdaq. But you want to find the very best stocks right now to generate massive gains. The IBD Methodology offers clear guidelines on what you should be looking for. Invest in stocks with recent quarterly and annual earnings growth of at least 25%. Look for companies that have new, game-changing products and services. Also consider not-yet-profitable companies, often recent IPOs, that are generating tremendous revenue growth. Using such an approach can help give you an edge over the benchmark S&P 500. Outdoing this industry benchmark is key to generating exceptional returns over the long term. In addition, keep an eye on supply and demand for the stock itself, focus on leading stocks in top industry groups, and aim for stocks with strong institutional support. Once you have found a stock that fits the criteria, it is then time to turn to stock charts to plot a good entry point. You should wait for a stock to form a base and then buy it once it reaches a buy point, ideally in heavy volume. In many cases, a stock reaches a proper buy point when it breaks above the original high on the left side of the base. More information on what a base is, and how charts can be used to win big on the stock market, can be found here. IBD Newsletters Get exclusive IBD analysis and actionable news daily. SIGN UP NOW! IBD Newsletters Get exclusive IBD analysis and actionable news daily. How To Invest Market Prep Tech Report Please enter a valid email address Please select a newsletter GO Get these newsletters delivered to your inbox & more info about our products & services.",
      "timestamp": "2025-05-23T16:40:27.512365"
    },
    {
      "url": "https://www.morningstar.com/stocks/10-best-companies-invest-now",
      "content": "Table of Contents 10 Best Stocks to Buy Now—May 2025 Polaris Nike Pfizer Campbell Yum China Holdings Taiwan Semiconductor Manufacturing Brown-Forman GSK Alphabet Thermo Fisher Scientific Find More of the Best Stocks to Invest In Home Stocks The 10 Best Companies to Invest in Now The 10 Best Companies to Invest in Now These undervalued stocks of high-quality companies are attractive investments today. Margaret Giles Apr 30, 2025 Share Securities In This Article Alphabet Inc Class A (GOOGL) Brown-Forman Corp Registered Shs -B- Non Vtg (BF.B) Nike Inc Class B (NKE) GSK PLC ADR (GSK) Yum China Holdings Inc (YUMC) +6 More The US market looks expensive, so investors may be wondering which stocks to buy now against this backdrop. Regardless of where the markets are headed, investors may want to own companies that offer some sense of certainty in terms of cash flows and company fundamentals. That’s where Morningstar’s Best Companies to Own list comes in. The companies that make up this list have significant competitive advantages. We believe the best companies have predictable cash flows and are run by management teams that have a history of making smart capital-allocation decisions. But the best companies aren’t always the best stocks to buy. How much an investor pays to own a company—best or otherwise—is important, too. So, here we’re focusing on the 10 best companies to invest in with the most undervalued stock prices today. 10 Best Stocks to Buy Now—May 2025 The 10 most undervalued stocks from our Best Companies to Own list as of April 28, 2025, were: Polaris PII Nike NKE Pfizer PFE Campbell CPB Yum China Holdings YUMC Taiwan Semiconductor Manufacturing TSM Brown-Forman BF.B GSK GSK Alphabet GOOGL Thermo Fisher Scientific TMO Here’s a little bit about why we like each of these companies at these prices, along with some key Morningstar metrics. All data is as of market close on April 28. Polaris Price/Fair Value: 0.45 Morningstar Uncertainty Rating: Medium Morningstar Capital Allocation Rating: Exemplary Industry: Recreational Vehicles Polaris is the most undervalued stock on our list of best companies to buy again this month, trading 55% below our fair value estimate of $75 per share. Polaris is one of the longest-operating brands in powersports. The company started to build its reputation and brand by producing snowmobiles and has since expanded into all-terrain vehicles, motorcycles, boats, and electric vehicles, building a recreational and utility vehicle powerhouse. We think Polaris stands to capitalize on its research and development, solid quality, operational excellence, and acquisition strategy, says Morningstar senior analyst Jaime Katz. Peers are innovating more quickly than in the past, however, which could jeopardize the firm’s ability to take price and share consistently. Still, with supply chain constraints largely in the rearview mirror, we expect incremental improvement in market share for Polaris moving forward. Nike Price/Fair Value: 0.51 Morningstar Uncertainty Rating: Medium Morningstar Capital Allocation Rating: Exemplary Industry: Footwear and Accessories The largest athletic footwear brand in all major categories and all major markets, Nike dominates categories like running and basketball with popular shoe styles. We view Nike as the leader of the athletic apparel market and believe it will overcome current challenges, such as uneven demand for sportswear in key markets and high tariff exposure, argues Morningstar senior analyst David Swartz. Nike has a renewed focus on its key partners, its products, and its connections to international athletics under new CEO Elliott Hill. Hill is investing in new marketing and products while rebuilding Nike’s relationships with retailers and the global sports community. Nike stock trades at a 49% discount to our fair value estimate of $112 per share. Pfizer Price/Fair Value: 0.57 Morningstar Uncertainty Rating: Medium Morningstar Capital Allocation Rating: Standard Industry: Drug Manufacturers—General A household name among drug manufacturers, Pfizer stock is currently trading at a 43% discount to its fair value estimate of $42 per share. The company’s large size gives it significant competitive advantages in developing new drugs, and its diverse portfolio of drugs helps insulate the company from any one particular patent loss, says Morningstar director Karen Andersen.",
      "timestamp": "2025-05-23T16:40:37.678537"
    },
    {
      "url": "https://money.usnews.com/investing/articles/trending-stocks-to-buy-right-now",
      "content": "5 Trending Stocks to Buy Now Investing Money Home 5 Trending Stocks to Buy Today These stocks are trending decisively higher, despite the uncertainty that's been a drag on the markets in 2025. By Glenn Fydenkevez | Reviewed by John Divine | May 21, 2025 By Glenn Fydenkevez | Reviewed by John Divine | May 21, 2025, at 3:09 p.m. Save More 5 Trending Stocks to Buy Now More Getty Images IBM, the elder statesman of tech companies, is a familiar name on this list of trending stocks. The U.S. equity markets have had a lot to deal with so far in 2025. The year began with a new administration in Washington, and questions about the direction of inflation and interest rates in the coming months. The stock market fared well in the early going, with the S&P 500 reaching all-time highs on Feb. 19. As President Donald Trump's economic and trade policies began to take shape, however, markets became skittish. On April 2, the president unveiled an aggressive new trade regime that featured punitive tariffs on friends and foes alike. That prompted a global sell-off in U.S. equities as Wall Street and the world tried to digest the news. Inflation fears came back to the fore, and the price of the 10-year U.S. Treasury bonds fell, driving the yield of that benchmark security sharply higher. Investors, businesses and financial institutions began to contemplate the possibility of a near-term recession. On April 8, the S&P 500 closed at its 2025 low, having fallen 18.9% from its high and 15.2% for the year. Related: Sign up for stock news with our Invested newsletter. The picture has changed since then, and Wall Street's worst-case scenarios appear for now to be off the table. The president has been encouraged by conciliatory gestures from U.S. trading partners and seems to be settling into a more reasonable and manageable position on tariffs. Recent numbers on employment and inflation show a resilient U.S. economy, and corporate earnings have held up well in the face of all the uncertainty. The S&P 500 has made steady upward progress off its lows and, as of the close on May 20, has registered a 1% gain for the calendar year. Retail investors can't be blamed for feeling overwhelmed or even a little confused by today's market. Breaking news or rumors regarding trade negotiations can send indexes like the Dow Jones Industrial Average, the Nasdaq composite or the S&P 500 soaring or tumbling, and a social media post from the White House can have a similar – positive or negative – effect. So, what's a small investor to do? When markets are tumultuous and index investing isn't paying off, one of the best strategies is to buy trending or rising stocks. When a stock is consistently going up while the broad market is struggling, it can be a sign of confidence from institutional investors. In other words, despite market and economic challenges, the smart money sees something it likes and is buying. The stocks on today's list fit that bill. All five are trending strongly to the upside and significantly beating the market. These companies seem to be immune to the chaos and disorder that's been such a drag on the market as a whole. They've all been rising steadily and, although no one can predict the future, none seem to be slowing down. Lists of this kind are not meant to be a substitute for sound financial advice or in-depth research, but they are a great place for interested investors to begin: Stock Year-to-date total return* International Business Machines Corp. (ticker: IBM ) 23.1% Allot Ltd. ( ALLT ) 33.6% NRG Energy Inc. ( NRG ) 78.5% Okta Inc. ( OKTA ) 59.3% Palantir Technologies Inc. ( PLTR ) 66.1% *Total returns include any dividends paid, and are accurate through the May 20 close. SPONSORED Find Your Financial Advisor 1. Finding a financial advisor who understands your unique situation doesn’t have to be difficult. AdvisorFinder lets you quickly browse, research, and connect with financial advisors. 2.",
      "timestamp": "2025-05-23T16:41:19.106074"
    }
  ],
  "search_history": [
    {
      "query": "articles or reports from financial analysts and investment platforms that provide specific stock picks or lists of top stocks to buy this month.",
      "results": "1. **No title**\n   URL: https://www.investors.com/research/best-stocks-to-buy-now/\n   Description: \n\n2. **No title**\n   URL: https://www.morningstar.com/stocks/10-best-companies-invest-now\n   Description: \n\n3. **No title**\n   URL: https://www.investors.com/\n   Description: \n\n4. **No title**\n   URL: https://money.usnews.com/investing/articles/trending-stocks-to-buy-right-now\n   Description: \n\n5. **No title**\n   URL: https://www.fool.com/investing/top-stocks-to-buy-and-hold/\n   Description: "
    }
  ],
  "timestamp": "2025-05-23T16:41:32.816369"
}