{
  "search_term": "what happened to amelia aerhart",
  "visited_articles": [
    {
      "url": "https://www.cnn.com/2024/11/21/science/amelia-earhart-plane-anomaly-update",
      "content": "Sonar imagery taken on November 1 shows the previously unidentified rock formation that was suspected to be Amelia Earhart's missing plane. Deep Sea Vision\n\nSign up for CNN’s Wonder Theory science newsletter. Explore the universe with news on fascinating discoveries, scientific advancements and more. CNN — The disappearance of pioneering aviator Amelia Earhart more than 87 years ago has remained one of the most captivating mysteries in history, with a handful of explorers devoted to scouring the seas for any clue to her final whereabouts. Sonar imagery captured in January revealed a plane-shaped anomaly on the seafloor about 100 miles away (161 kilometers) from the Pacific Ocean’s Howland Island — the next location where Earhart was expected to land before she was declared lost at sea. The detection renewed a worldwide interest in the mystery and left many questioning whether Earhart’s missing Lockheed 10-E Electra had finally been found. The wreckage of the Mary Rose at The Mary Rose Museum in Portsmouth, England. The Mary Rose Trust Related article A Tudor warship sank nearly 500 years ago. The bones of its crew reveal what life was like After returning to the site on November 1, Deep Sea Vision — an ocean exploration company based in Charleston, South Carolina, that captured the original sonar image — has identified the object to be a natural rock formation. Ad Feedback Ad Feedback “Talk about the cruelest formation ever created by nature,” said Tony Romeo, the company’s CEO, a pilot and former US Air Force intelligence officer. “It’s almost like somebody did set those rocks out in this nice little pattern of her plane, just to mess with somebody out there looking for her.” Romeo said he was surprised the object wasn’t at least a different plane or a man-made object. “We didn’t pop any champagne bottles on the first time around, because we wanted to be 100% sure, (but) there was a somber moment,” Romeo told CNN in a phone call. “I think everyone just kind of took a little bit of time, little space, and then we recollected ourselves … and we got right back to work on searching some new areas that we wanted to search.” Deep Sea Vision announced the update in an Instagram post on November 6, saying its search continues. After discovering the rock formation, the expedition crew explored more than 1,000 square miles (2,590 square kilometers) for a search total of at least 7,700 square miles (19,943 square kilometers) of ocean, Romeo said. While it was not the update the team expected, Romeo and other experts said that hope shouldn’t be lost for finding closure one day for the aviation legend. Deep Sea Vision/PR Newswire Deep Sea Vision A comparison of sonar imagery revealed by Deep Sea Vision in January (left) and November (right) shows why the search continues for Amelia Earhart's missing plane. Deep Sea Vision/PR Newswire The hunt for Earhart’s plane continues The rock formation was more than 16,000 feet (4,877 meters) underwater. Upon first discovery, the team’s advanced autonomous underwater vehicle, or AUV, a device that maps the seabed using sonar technology, was about 1,640 feet (500 meters) away, Romeo said. The team sent out the AUV directly above the site in early November, producing a high-resolution image of the rock formation. “The mood was very jubilant on the way out,” Romeo said. “We were excited (but) cautiously optimistic because we knew there was a possibility that (the anomaly) may not be what we thought it was, but obviously everybody was excited.” It was a long wait for the AUV to get into position to scan the object — about 24 hours from launch until the team could see the data, Romeo said. After the anxious wait, the image surprisingly revealed that the object was a natural rock formation, he said. Romeo said other images further confirmed the rock formation, but the company is not yet releasing any material other than one sonar image, as a documentary on the expedition is in the works.",
      "timestamp": "2025-05-24T14:40:39.824853"
    },
    {
      "url": "https://www.cbsnews.com/news/amelia-earhart-plane-possibly-detected-sonar-underwater-deep-sea-vision/",
      "content": "U.S. Amelia Earhart's long-lost plane possibly detected by sonar 16,000 feet underwater, exploration team claims By Stephen Smith Stephen Smith Managing Editor Stephen Smith is a managing editor for CBSNews.com based in New York. A Washington, D.C. native, Steve was previously an editorial producer for the Washington Post, and has also worked in Los Angeles, Boston and Tokyo. Read Full Bio Stephen Smith Updated on: January 30, 2024 / 10:30 AM EST / CBS News\n\nAmelia Earhart's disappearance over the central Pacific Ocean 87 years ago remains one of the greatest mysteries in aviation history. Countless theories about her fate have emerged in the decades since, but now a deep-sea exploration team searching for the wreckage of her small plane has provided another potential clue — including a new video released Monday.\n\nDeep Sea Vision, a Charleston, South Carolina-based team, said this weekend that it had captured a sonar image in the Pacific Ocean that \"appears to be Earhart's Lockheed 10-E Electra\" aircraft.\n\nThe company, which says it scanned over 5,200 square miles of the ocean floor starting in September, posted sonar images on social media that appear to show a plane-shaped object resting at the bottom of the sea. The 16-member team, which used a state-of-the-art underwater drone during the search, also released a new video of the expedition Monday evening, showing the team reviewing images taken by a submersible.\n\n\"After an extensive deep-water search, a talented group of underwater archaeologists and marine robotics experts have unveiled a sonar image that may answer the greatest modern mystery — the disappearance of Amelia Earhart,\" Deep Sea Vision wrote on Instagram.\n\nTony Romeo, a pilot and former U.S. Air Force intelligence officer, told the Wall Street Journal that he funded the $11 million search by selling off his commercial real estate properties.\n\n\"This is maybe the most exciting thing I'll ever do in my life,\" he told the Journal. \"I feel like a 10-year-old going on a treasure hunt.\"\n\nEarhart and navigator Fred Noonan disappeared on July 2, 1937, while flying over the Pacific Ocean during Earhart's attempt to become the first female aviator to circle the globe. They vanished without a trace, spurring the largest and most expensive search and rescue effort by the U.S. Navy and Coast Guard in American history. Earhart and Noonan were declared dead two years later.\n\nMultiple deep-sea searches using high-tech equipment have tried but failed over the years to find Earhart's plane.\n\nRomeo told the Journal that his team's underwater \"Hugin\" submersible captured the sonar image of the aircraft-shaped object about 16,000 feet below the Pacific Ocean's surface less than 100 miles from Howland Island, where Earhart and Noonan were supposed to stop and refuel before they vanished.\n\nRomeo's team didn't find the image until about three months into the trip, and at that stage it was impractical to turn back, he told the Journal, so they intend to return for a closer look.\n\nSonar experts told the Journal that only a closer look for details matching Earhart's Lockheed aircraft would provide definitive proof.\n\n\"Until you physically take a look at this, there's no way to say for sure what that is,\" underwater archaeologist Andrew Pietruszka told the newspaper.\n\nThere other theories about where Earhart may have vanished. Ric Gillespie, who has researched Earhart's doomed flight for decades, told CBS News in 2018 that he had proof Earhart crash-landed on Gardner Island — about 350 nautical miles from Howland Island — and that she called for help for nearly a week before her plane was swept out to sea.\n\nGillespie told CBS News the calls weren't just heard by the Navy, but also by dozens of people who unexpectedly picked up Earhart's transmissions on their radios thousands of miles away. Reports of people hearing calls for help were documented in places like Florida, Iowa and Texas.",
      "timestamp": "2025-05-24T14:40:51.897366"
    },
    {
      "url": "https://en.wikipedia.org/wiki/Speculation_on_the_disappearance_of_Amelia_Earhart_and_Fred_Noonan",
      "content": "Article Talk English Read Edit View history Tools Tools move to sidebar hide Actions Read Edit View history General What links here Related changes Upload file Permanent link Page information Cite this page Get shortened URL Download QR code Add interlanguage links Expand all Print/export Download as PDF Printable version In other projects Wikidata item\n\nAppearance move to sidebar hide Text Small Standard Large This page always uses small font size Width Standard Wide The content is as wide as possible for your browser window. Color (beta) Automatic Light Dark This page is always in light mode.\n\nFrom Wikipedia, the free encyclopedia Theories on 1937 disappearance of American aviators This article contains one or more duplicated citations. show The reason given is: DuplicateReferences detected: http://news.discovery.com/history/us-history/aluminum-fragment-appears-to-belong-to-earharts-plane-141028.htm (refs: 33, 34) http://tighar.org/Projects/Earhart/Books/BookReviews/earhartsurvive.html (refs: 61, 62) It is recommended to use named references to consolidate citations that are used multiple times. ( April 2025 ) ( Learn how and when to remove this message ) Amelia Earhart and Fred Noonan Speculation on the disappearance of Amelia Earhart and Fred Noonan has continued since their disappearance in 1937. After the largest search and rescue attempt in history up to that time, the U.S. Navy concluded that Earhart and Noonan ditched at sea after their plane ran out of fuel; this \"crash and sink theory\" is the most widely accepted explanation. However, several alternative hypotheses have been considered. [ 1 ] Theories [ edit ] Gardner Island hypothesis [ edit ] Gardner ( Nikumaroro ) Island in 2014. \"Seven Site\" is a focus of the search for Earhart's remains. The Gardner Island hypothesis assumes that Earhart and Noonan, unable to find Howland Island, would not waste time searching for it, instead turning to the south to look for other islands. The 157/337 radio transmission suggests they flew a course of 157° that would take them past Baker Island; if they missed this, then sometime later they would fly over the Phoenix Islands, now part of the Republic of Kiribati, about 350 nautical miles (650 km) south-southeast of Howland Island. One of the Phoenix Islands, known as Gardner Island (now Nikumaroro), has been the subject of inquiry as a possible crash-landing site. The International Group for Historic Aircraft Recovery ( TIGHAR ) presented a hypothesis that Earhart and Noonan found Gardner Island, uninhabited at the time, landed the Electra on a flat reef near the November 1929 wreck of freighter SS Norwich City, and sent sporadic radio messages from there. [ 2 ] Ric Gillespie, author of Finding Amelia, wrote that while listening to alleged radio signals on their home radios, Mabel Larremore heard a woman claiming to be Earhart say Noonan was \"seriously injured\" and that she had \"some injuries but not as serious as Mr. Noonan's.\" Betty Klenck heard an apparently injured man acting agitated with a distressed woman claiming to be Earhart, and uttering repeatedly what sounded like, \"Marie\". Noonan's wife's first name was Mary Bea. The man said \"Water's knee deep – let me out.\" Klenck heard the woman say, \"George, get the suitcase in my closet...California.\" Four years earlier, in a letter to her mother, Earhart had asked that, should anything ever happen to her, the suitcase of private papers stored in her closet in California be destroyed; George Putnam was her husband. Klenck heard the woman repeatedly say something that sounded like \"New York City\", which has been speculated to have been actually Norwich City, the freighter wreck. A week after Earhart and Noonan disappeared, Navy planes from USS Colorado (which had sailed from Pearl Harbor ) searched Gardner Island. The planes saw signs of recent habitation and the wreck of the SS Norwich City, but no aircraft, and repeated circling failed to bring out any signs of survivors seeking rescue. [ 3 ] TIGHAR theorises that the Electra had by then been washed over the reef edge into the ocean where it broke up and sank.",
      "timestamp": "2025-05-24T14:40:59.130553"
    }
  ],
  "search_history": [
    {
      "query": "Amelia Earhart disappearance theories latest news",
      "results": "1. **No title**\n   URL: https://nypost.com/2025/01/22/us-news/archaeological-legacy-institute-to-embark-on-expedition-to-find-amelia-earharts-long-lost-plane/\n   Description: \n\n2. **No title**\n   URL: https://www.cnn.com/2024/11/21/science/amelia-earhart-plane-anomaly-update\n   Description: \n\n3. **No title**\n   URL: https://www.cbsnews.com/news/amelia-earhart-plane-possibly-detected-sonar-underwater-deep-sea-vision/\n   Description: \n\n4. **No title**\n   URL: https://www.ameliaearhart.com/news/\n   Description: \n\n5. **No title**\n   URL: https://en.wikipedia.org/wiki/Speculation_on_the_disappearance_of_Amelia_Earhart_and_Fred_Noonan\n   Description: "
    }
  ],
  "timestamp": "2025-05-24T14:41:12.714015"
}