{
  "search_term": "upcoming pghsocialclub events",
  "visited_articles": [
    {
      "url": "https://www.pghsocialclub.com/events",
      "content": "A day in the park Saturday, May 31, 2025 2:00 PM 5:00 PM Google Calendar ICS Join us for the perfect summer day! We'll bring the music, you bring the fun. Please bring picnic blankets, snacks, spikeball, frisbee, or any lawn games you choose! Sign up here! View Event →\n\nPA Market Matchbox night!! Friday, May 16, 2025 8:00 PM 10:00 PM Google Calendar ICS we are BACK with another @matchbox.party event! find com patible friend matches on may 16th at @thepamarket 👥 how Mat chbox works: 1. fill out a questionnaire about your values 2. get to know each other over some amazing drinks 3. find out the name of your most compatible friend match at the party at 9:30 pm! ⚡️ schedule — 8pm: event starts 9pm: sets of clues are sent 9:30: final matches are revealed why $10 tickets? * admission * matchbox software * private space! link to sign up here! grab a spot and find your friend match 😆 View Event →\n\nSunset & Sip Saturday, April 19, 2025 6:00 PM 8:00 PM Google Calendar ICS we are excited to announce our first Sip & Sunset event with the live music from Supasata! Happenstance is a cute new cafe with a beautiful outdoor area and we knew we had to have an event here:) excited for you all to see it after party details coming soon 👀 limited spots available, sign up here View Event →\n\nKingfly Social w/ Matchbox Friday, April 4, 2025 8:00 PM 10:10 PM Google Calendar ICS Due to heavy demand @ matchbox.party is back!! we a re so excited to use Matchbox again to find compatible friend matches at @kingflyspirits How Matchbox works: 1. Fill out a questionnaire about your values 2. Get to know each other over some amazing drinks 3. Find out the name of your most compatible friend match at the party at 9:30 pm 🎉 Schedule 8pm: events starts 9pm: sets of clues are sent 9:30: final matches are revealed *we will be in a larger space and will have group numbers posted around the room to avoid confusion when clues are released! thank you again to @kingflyspirits for the special WELCOME COCKTAIL included with ticket:) Why $10? * Admission * Matchbox software * Welcome Cocktail * Private space limited spots available! Sign up here! View Event →\n\nPickleball!!! Saturday, March 22, 2025 2:00 PM 4:00 PM The pickleball warehouse (map) Google Calendar ICS The heavily requested Pickleball event is here!! come check out the NEW indoor @thepickleballwarehousepgh free play - paddles and balls are included ALL skill levels of Pickleball players are welcome can’t wait to see you there:) 📍The Pickleball Warehouse Why $15 - court reservation cost - paddles and balls signup here! View Event →\n\nDinner with strangers Thursday, March 13, 2025 6:30 AM 9:30 AM Google Calendar ICS 60 seats. 10 tables. One fantastic night. Sign up here View Event →\n\nKingfly friendship bingo Friday, February 28, 2025 8:00 PM 9:05 PM Google Calendar ICS Join us for a fun night at @kingflyspirits! Enjoy a welcome cocktail while playing friend bingo! 🍸 How it Works: - Enjoy a normal bar night with an added friend bingo element twist ✨ - Fill out your bingo card by meeting new people who initial each square until your card is full - 🚨Each completed bingo card will be entered into a live raffle to win prizes at the end of the night! There is no rush, as long as you complete and turn in your sheet before the raffle you are entered! 🚨 Why $10? - Admission (private space) - Friend Bingo - Prizes for Bingo - Welcome Cocktail Sign up here!.... #explore#pghsocialclub#socialclub#youngadults#20somethings#ilovepittsburgh#pittsburgh#pgh#thingstodoinpittsburgh#pittsburghevents View Event →\n\nSuper Bowl Watch Party Sunday, February 9, 2025 5:00 PM 6:45 PM Google Calendar ICS our next event is going to be a Super Bowl watch party at Bottlerocket",
      "timestamp": "2025-05-23T16:44:53.834145"
    }
  ],
  "search_history": [
    {
      "query": "Events:** Once I verify the organization, I will look for a website or social media accounts that provide details about upcoming events. This may include their official site, event platforms, or social media pages.",
      "results": "1. **No title**\n   URL: https://help.hootsuite.com/hc/en-us/articles/4403597090459-Create-engaging-and-effective-social-media-content\n   Description: \n\n2. **No title**\n   URL: https://www.bizzabo.com/blog/event-technology-guide\n   Description: \n\n3. **No title**\n   URL: https://pmc.ncbi.nlm.nih.gov/articles/PMC8853081/\n   Description: \n\n4. **No title**\n   URL: http://www.osha.gov/\n   Description: \n\n5. **No title**\n   URL: https://www.pewresearch.org/internet/2017/10/19/the-future-of-truth-and-misinformation-online/\n   Description: "
    },
    {
      "query": "pghsocialclub Pittsburgh events",
      "results": "1. **No title**\n   URL: https://www.pghsocialclub.com/\n   Description: \n\n2. **No title**\n   URL: https://www.pghsocialclub.com/events\n   Description: \n\n3. **No title**\n   URL: https://www.instagram.com/pghsocialclub/\n   Description: \n\n4. **No title**\n   URL: https://www.meetup.com/pittsburgh-social-club/\n   Description: \n\n5. **No title**\n   URL: https://www.facebook.com/groups/PittsburghSocialClub/\n   Description: "
    }
  ],
  "timestamp": "2025-05-23T16:45:08.952440"
}