{
  "search_term": "hernan badino",
  "visited_articles": [
    {
      "url": "https://scholar.google.com/citations?user=Wt0599IAAAAJ&hl=en",
      "content": "Loading... The system can't perform the operation now. Try again later. Citations per year Duplicate citations The following articles are merged in Scholar. Their combined citations are counted only for the first article. Merged citations This \"Cited by\" count includes citations to the following articles in Scholar. The ones marked * may be different from the article in the profile. Add co-authors Co-authors Follow New articles by this author New citations to this author New articles related to this author's research Email address for updates Done My profile My library Metrics Alerts Settings Sign in Sign in Get my own profile Cited by View all All Since 2020 Citations 3159 1142 h-index 23 17 i10-index 30 21 0 280 140 70 210 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 2020 2021 2022 2023 2024 2025 10 53 70 74 124 140 145 213 216 230 277 236 184 166 227 224 242 206 77 Public access View all View all 2 articles 0 articles available not available Based on funding mandates Co-authors Daniel Huber Senior Systems Scientist, Carnegie Mellon University Verified email at cs.cmu.edu Stefan Gehrig Distinguished Scientist, Mercedes Benz AG, Lecturer Cooperate State University Stuttgart Verified email at daimler.com Daniel Cremers Technical University of Munich Verified email at tum.de Rudolf Mester NTNU Trondheim, Norway Verified email at ntnu.no Fernando De la Torre Research Associate Professor, Carnegie Mellon University Verified email at cs.cmu.edu Aayush Bansal Reality Labs Research, Meta Platforms Inc Verified email at fb.com Danfei Xu Assistant Professor at School of Interactive Computing Verified email at gatech.edu Pascal Paysan Varian Medical Systems Imaging Lab GmbH Verified email at unibas.ch Andreas Wedel SW Engineering Lead Follow Hernan Badino Reality Labs Research, Meta Verified email at fb.com Computer Vision Perception Deep Learning Articles Cited by Public access Co-authors Title Sort Sort by citations Sort by year Sort by title Cited by Cited by Year The stixel world-a compact medium level representation of the 3d-world H Badino, U Franke, D Pfeiffer Pattern Recognition: 31st DAGM Symposium, Jena, Germany, September 9-11 …, 2009 303 2009 6d-vision: Fusion of stereo and motion for robust environment perception U Franke, C Rabe, H Badino, S Gehrig Joint Pattern Recognition Symposium, 216-223, 2005 303 2005 Free space computation using stochastic occupancy grids and dynamic programming H Badino, U Franke, R Mester Workshop on Dynamical Vision, ICCV, Rio de Janeiro, Brazil 20, 73, 2007 286 2007 Real-time topometric localization H Badino, D Huber, T Kanade 2012 IEEE International conference on robotics and automation, 1635-1642, 2012 238 2012 Visual topometric localization H Badino, D Huber, T Kanade 2011 IEEE Intelligent vehicles symposium (IV), 794-799, 2011 187 2011 Visual odometry by multi-frame feature integration H Badino, A Yamamoto, T Kanade Proceedings of the IEEE International Conference on Computer Vision …, 2013 174 2013 B-spline modeling of road surfaces with an application to free-space estimation A Wedel, H Badino, C Rabe, H Loose, U Franke, D Cremers IEEE transactions on Intelligent transportation systems 10 (4), 572-583, 2009 163 2009 VR facial animation via multiview image translation SE Wei, J Saragih, T Simon, AW Harley, S Lombardi, M Perdoch, A Hypes,... ACM Transactions on Graphics (ToG) 38 (4), 1-16, 2019 153 2019 xr-egopose: Egocentric 3d human pose from an hmd camera D Tome, P Peluse, L Agapito, H Badino Proceedings of the IEEE/CVF International Conference on Computer Vision …, 2019 142 2019 Extrinsic calibration of a single line scanning lidar and a camera K Kwak, DF Huber, H Badino, T Kanade 2011 IEEE/RSJ International Conference on Intelligent Robots and Systems …, 2011 135 2011 Fast and accurate computation of surface normals from range images H Badino, D Huber, Y Park, T Kanade 2011 IEEE International Conference on Robotics and Automation, 3084-3091, 2011 122 2011 A robust approach for ego-motion estimation using a mobile stereo platform H Badino International Workshop on Complex Motion, 198-208, 2004 102 2004 A Head-Wearable Short-Baseline Stereo System for the Simultaneous Estimation of Structure and Motion.",
      "timestamp": "2025-05-23T16:46:27.028240"
    },
    {
      "url": "https://www.researchgate.net/scientific-contributions/Hernan-Badino-69687579",
      "content": "What is this page? This page lists works of an author who doesn't have a ResearchGate profile or hasn't added the works to their profile yet. It is automatically generated from public (personal) data to further our legitimate goal of comprehensive and accurate scientific recordkeeping. If you are this author and want this page removed, please let us know. Publications (19) Topometric localization on a road network Article October 2014 · 48 Reads · 20 Citations Danfei Xu · Hernan Badino · Daniel Huber Current GPS-based devices have difficulty localizing in cases where the GPS signal is unavailable or insufficiently accurate. This paper presents an algorithm for localizing a vehicle on an arbitrary road network using vision, road curvature estimates, or a combination of both. The method uses an extension of topometric localization, which is a hybrid between topological and metric localization. The extension enables localization on a network of roads rather than just a single, non-branching route. The algorithm, which does not rely on GPS, is able to localize reliably in situations where GPS-based devices fail, including 'urban canyons' in downtown areas and along ambiguous routes with parallel roads. We demonstrate the algorithm experimentally on several road networks in urban, suburban, and highway scenarios. We also evaluate the road curvature descriptor and show that it is effective when imagery is sparsely available. Read more Understanding how camera configuration and environmental conditions affect appearance-based localization Conference Paper June 2014 · 69 Reads · 30 Citations Aayush Bansal · Hernan Badino · Daniel Huber Localization is a central problem for intelligent vehicles. Visual localization can supplement or replace GPS-based localization approaches in situations where GPS is unavailable or inaccurate. Although visual localization has been demonstrated in a variety of algorithms and systems, the problem of how to best configure such a system remains largely an open question. Design choices, such as “where should the camera be placed?” and “how should it be oriented?” can have substantial effect on the cost and robustness of a fielded intelligent vehicle. This paper analyzes how different sensor configuration parameters and environmental conditions affect visual localization performance with the goal of understanding what causes certain configurations to perform better than others and providing general principles for configuring systems for visual localization. We ground the investigation using extensive field testing of a visual localization algorithm, and the data sets used for the analysis are made available for comparative evaluation. Read more Visual Odometry by Multi-frame Feature Integration Conference Paper December 2013 · 125 Reads · 140 Citations Hernán Badino · Akihiro Yamamoto · Takeo Kanade This paper presents a novel stereo-based visual odometry approach that provides state-of-the-art results in real time, both indoors and outdoors. Our proposed method follows the procedure of computing optical flow and stereo disparity to minimize the re-projection error of tracked fea ture points. However, instead of following the traditional approach of performing this task using only consecutive frames, we propose a novel and computationally inexpensive technique that uses the whole history of the tracked feature points to compute the motion of the camera. In our technique, which we call multi-frame feature integration, the features measured and tracked over all past frames are integrated into a single, improved estimate. An augmented feature set, composed of the improved estimates, is added to the optimization algorithm, improving the accuracy of the computed motion and reducing ego-motion drift. Experimental results show that the proposed approach reduces pose error by up to 65% with a negligible additional computational cost of 3.8%. Furthermore, our algorithm outperforms all other known methods on the KITTI Vision Benchmark data set. Read more CANINE: a robotic mine dog Article February 2013 · 35 Reads Proceedings of SPIE - The International Society for Optical Engineering Brian A. Stancil · Jeffrey Hyams · Jordan Shelley · [...] · Parag Batavia Neya Systems, LLC competed in the CANINE program sponsored by the U.S. Army Tank Automotive Research Development and Engineering Center (TARDEC) which culminated in a competition held at Fort Benning as part of the 2012 Robotics Rodeo.",
      "timestamp": "2025-05-23T16:46:44.048184"
    }
  ],
  "search_history": [
    {
      "query": "information on Hernan Badino. ",
      "results": "1. **No title**\n   URL: https://www.linkedin.com/in/hernan-badino-5254747\n   Description: \n\n2. **No title**\n   URL: https://ieeexplore.ieee.org/author/37089851239\n   Description: \n\n3. **No title**\n   URL: https://scholar.google.com/citations?user=Wt0599IAAAAJ&hl=en\n   Description: \n\n4. **No title**\n   URL: https://www.researchgate.net/scientific-contributions/Hernan-Badino-69687579\n   Description: \n\n5. **No title**\n   URL: https://independent.academia.edu/Hern%C3%A1nBadino\n   Description: "
    }
  ],
  "timestamp": "2025-05-23T16:46:56.828480"
}